["AbaClient allows to log-in into your Abacus Business Software or AbaWeb - without any internet browser and without having java installed.","Messaging app for WhatsApp, Slack, Telegram, HipChat, Hangouts and many many more.","Artha is a handy thesaurus based on WordNet with distinct features like global hotkey look-up, passive desktop notifications, regular expression based search, etc.. Artha may be used as a free open-source replacement to the proprietary WordWeb Pro.","Arcade style game in the tradition of Boulder Dash, Emerald Mine, Supaplex and Sokoban. Featuring classic Amiga style graphics, stereo sounds and MOD music.","Sourcetree is a free Git desktop client for developers on Windows. Say goodbye to the command line and use the full capabilities of Git through Sourcetree's beautifully simple interface (and stop being jealous of what your Mac friends are using).","Sourcetree is a free Git desktop client for developers on Windows. Say goodbye to the command line and use the full capabilities of Git through Sourcetree's beautifully simple interface (and stop being jealous of what your Mac friends are using).","Automation-friendly framework for Continuous Testing","Blender is the free and open source 3D creation suite. It supports the entirety of the 3D pipeline—modeling, rigging, animation, simulation, rendering, compositing and motion tracking, video editing and 2D animation pipeline.","CPU-Z is a freeware that gathers information on some of the main devices of your system","The K-Lite Codec Pack is a collection of DirectShow filters, VFW/ACM codecs, and tools. Codecs and DirectShow filters are needed for encoding and decoding audio and video formats. The K-Lite Codec Pack is designed as a user-friendly solution for playing all your audio and movie files. With the K-Lite Codec Pack you should be able to play all the popular audio and video formats and even several less common formats.","A HDD/SSD utility software which supports a part of USB, Intel/AMD RAID and NVMe.","A lightweight, versatile image viewer","Empoche combines time tracking and task management in an unique new way. Learn where you lose time and get more productive.","Planet Blupi (known as Planet Eggbert too) is a strategy and adventure game. It subtly blends action with thought-provoking challenges. Behind the quiet and gentle facade, you'll enjoy a fascinating diversion full of surprises.","Metro Commander modern two panes file manager.","PhantomPDF is the PDF Editor that enables PDF document accessibility for people with disabilities who use assistive technology to have access to information.","Free Pascal is a 32, 64 and 16 bit professional Pascal compiler. It can target many processor architectures.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","GNU Octave is a high-level language, primarily intended for numerical computations. It provides a convenient command line interface for solving linear and nonlinear problems numerically, and for performing other numerical experiments using a language that is mostly compatible with Matlab. It may also be used as a batch-oriented language.","Community-driven, Vendor-neutral build of OpenJDK for Windows x64.","An easy-to-use, multi-track audio editor and recorder.","A control panel for all your WordPress sites.","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","glogg is a multi-platform GUI application to browse and search through long or complex log files. It is designed with programmers and system administrators in mind. glogg can be seen as a graphical, interactive combination of grep and less.","HttpMaster Express is a professional testing tool for HTTP applications, with special focus on RESTful web services and web API applications.","Capture Screen, WebCam, Audio, Cursor, Mouse Clicks and Keystrokes","Free multi-platform database tool for developers, database administrators, analysts and all people who need to work with databases. Supports all popular databases (MySQL, PostgreSQL, SQLite, Oracle, DB2, SQL Server, Sybase, MS Access, Teradata, Firebird, Apache Hive, Phoenix, Presto, etc)","The ipfilter.dat file helps protect your privacy and security when using Bit Torrent by blocking a list of potentially malicious peers. This utility downloads and installs a selected list for your Bit Torrent client.","MailWasher lets you preview all your email before it gets to your computer, enabling you to read all your email securely, and instantly delete any unwanted or suspicious email.","Boost your productivity and send better email with Mailspring, the best mail client for Mac, Linux, and Windows.","A free and opensource multiplatform 3D parametric modeler","Free and open source file archiver with a high compression ratio.","Free and open source file archiver with a high compression ratio.","AIMP is a freeware audio player","Free Log Viewer for easy & powerful log viewing.","Extendable electron-based open-source Spolight and Alfred analogue","Easily drag windows when pressing the alt key","The GNU Arm Embedded toolchain contains integrated and validated packages featuring the GCC compiler, libraries and other tools necessary for bare-metal software development on devices based on 32-bit Arm Cortex-A, Cortex-R and Cortex-M processors.","AxCrypt File Encryption Software - Free Personal Privacy and Security for Windows 2000/XP/Vista or later with AES-128 File Encryption, Compression and transparent Decrypt and Open in the original application.","Flash OS images to SD cards and USB drives, safely and easily.","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","ClipboardFusion makes it easy to remove clipboard text formatting, replace clipboard text or run powerful macros on your clipboard contents! You can even sync your clipboard with other computers and mobile devices.","A Free and Flexible SSH Client","CodeLite is an open source, free, cross platform IDE specialized in C, C++, PHP and JavaScript (mainly for backend developers using Node.js) programming languages which runs best on all major Platforms ( OSX, Windows and Linux )","Borderless Gaming is a simple tool that will allow you to turn your windowed video games into fullscreen applications without all of the negative side effects","Multi-platform transparent client-side encryption of your files in the cloud https://cryptomator.org/","High-Speed, Secure & Anonymous VPN Service","FontBase is a free cross-platform (Linux, OS X, Windows) font manager","A fast and friendly git client for Mac and Windows.","CLI tool to compute the TypeRefHash for .NET binaries.","AIMP is a freeware audio player","Cube 2: Sauerbraten is a free multiplayer & singleplayer first person shooter, the successor of the Cube FPS. Much like the original Cube, the aim of this game is fun, old school deathmatch gameplay and also to allow map/geometry editing to be done cooperatively in-game.","The free global standard for reliably viewing, printing, signing, and commenting on PDF documents.","Amazon Chime is a communications service that lets you meet, chat, and place business calls inside and outside your organization, all using a single application.","Graphical program used to map keyboard buttons and mouse controls to a gamepad. Useful for playing games with no gamepad support","3D multiplayer game with Tron-style lightcycles","Project Aurora is a utility that unifies RGB lighting devices across different brands and enables them to work alongside each other, all while adding and improving RGB lighting support for various games that previous had none or little RGB lighting support.","Flash OS images to SD cards and USB drives, safely and easily.","Unlike browser tabs, which work independently, Wavebox brings everything together as a single suite of web apps. For example, you’ll get notified on anything new across all your apps without having to check each tabs individually. You’ll also find it easier maintain context across workflows and stay focused.","Secure, Fast & Private Web Browser with Adblocker","Secure, Fast & Private Web Browser with Adblocker","Cisco Webex is the leading enterprise solution for video conferencing, online meetings, screen share, and webinars. Web conferencing, cloud calling and equipment.","The K-Lite Codec Pack is a collection of DirectShow filters, VFW/ACM codecs, and tools. Codecs and DirectShow filters are needed for encoding and decoding audio and video formats. The K-Lite Codec Pack is designed as a user-friendly solution for playing all your audio and movie files. With the K-Lite Codec Pack you should be able to play all the popular audio and video formats and even several less common formats.","A user-frandly translation tool for PDF reading. It automaticly removes line breaks from the text you copied and then display the translation result.","Free multi-platform database tool for developers, database administrators, analysts and all people who need to work with databases. Supports all popular databases (MySQL, PostgreSQL, SQLite, Oracle, DB2, SQL Server, Sybase, MS Access, Teradata, Firebird, Apache Hive, Phoenix, Presto, etc)","Seq is the easiest way for development teams to capture, search and visualize structured log events.","Docker Desktop is an application for MacOS and Windows machines for the building and sharing of containerized applications. Access Docker Desktop and follow the guided onboarding to build your first containerized application in minutes.","Play great PC games and connect with your friends, all in one place.","Evernote helps you focus on what matters most and have access to your information when you need it. Input typed notes or scan handwritten notes. Add to-do’s, photos, images, web pages, or audio ... and it’s all instantly searchable. Organize notes any way you want and share with anyone. And Evernote syncs across your devices so your information is always with you, everywhere you go.","High-Speed, Secure & Anonymous VPN Service","A powerful, lightweight, yet full-featured screen capture tool and screen video recorder.","GNU Solfege is an ear training program written to help you train intervals, chords, scales and rhythms. It is free software and part of the GNU Project. The program is indented to help music students with their ear training.","Directory Opus is a complete replacement for Explorer, with far more power and functionality than any other file manager available today.","A well-designed tool that helps you take control over your large files and get rid of the useless ones.","An open source editor for plain text. It is designed to be a small and fast.","Find files by name on your hard drives almost instantly.","WizTree is a hard drive disk space analyser similar to WinDirStat but is MUCH faster.","AnyDesk is a German proprietary remote desktop tool distributed by AnyDesk Software GmbH.","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","ClipboardFusion makes it easy to remove clipboard text formatting, replace clipboard text or run powerful macros on your clipboard contents! You can even sync your clipboard with other computers and mobile devices.","Bitwarden is a free and open source password manager for individuals, teams, and business organizations.","HttpMaster Express is a professional testing tool for HTTP applications, with special focus on RESTful web services and web API applications.","Secure, Fast & Private Web Browser with Adblocker","Secure, Fast & Private Web Browser with Adblocker","Buttercup is a password manager - an assistant for helping you store all of your login credentials. Buttercup helps you keep your accounts safe and assists you when you want to log in - all you need to do is remember just one password: your master password.","a chemically intelligent desktop toolkit built to help you draw, edit, publish, render, import and export your chemical structures and as well as allowing you to convert between various chemical and graphical file formats.","The Community Edition (CE) is best for noncommercial developers where basic availability, performance, scale, tooling, security capabilities and community support is sufficient. CE comes free and there are no constraints on using these binaries in production systems. However, CE is not subjected to the iterative \"test, fix, and verify\" quality assurance cycle that is a part of the Enterprise Edition release process. The release version of CE is several months behind EE. CE also does not include the latest bug fixes. Documentation, mailing lists, and forums provide support for the Couchbase user community to help troubleshoot issues and answer questions. CE comes with limited concurrency and parallelism and supports a maximum of 4 cores per node.","A HDD/SSD utility software which supports a part of USB, Intel/AMD RAID and NVMe.","LockHunter is a free 64/32 bit tool to delete files blocked by any processes","Dixa Desktop app for Windows and Mac","Docker Desktop is an application for MacOS and Windows machines for the building and sharing of containerized applications. Access Docker Desktop and follow the guided onboarding to build your first containerized application in minutes.","EditPlus is a text editor for Windows with built-in FTP, FTPS and sftp capabilities. While it can serve as a good Notepad replacement, it also offers many powerful features for Web page authors and programmers.","Winlogbeat, the open source tool for shipping Windows event logs to Elasticsearch to get insight into your system, application, and security information.","Elasticsearch is a distributed, RESTful search and analytics engine","Eraser is an advanced security tool for Windows which allows you to completely remove sensitive data from your hard drive by overwriting it several times with carefully selected patterns.","Files UWP is a modern File Explorer app for Windows","A Windows GUI based on Clash.","FreeMat is a free environment for rapid engineering and scientific prototyping and data processing. It is similar to commercial systems such as MATLAB from Mathworks, and IDL from Research Systems, but is Open Source.","Gforth is the Forth implementation of the GNU Project.","CutePDF Writer, Create PDFs from almost any application","Flash Player 32 PPAPI","The open-source Arduino Software (IDE) makes it easy to write code and upload it to the board.","Flash OS images to SD cards and USB drives, safely and easily.","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","Clean Your System and Free Disk Space","Build, render, and create LEGO instructions. Do it all in Studio 2.0. Intuitive and easy building.","Premium Markdown Editor","Firmware update utility for updating your Concept 2 Performance Monitor","Doxygen is the de facto standard tool for generating documentation from annotated C++ sources, but it also supports other popular programming languages such as C, Objective-C, C#, PHP, Java, Python, IDL (Corba, Microsoft, and UNO/OpenOffice flavors), Fortran, VHDL and to some extent D.","Working with Docker has never been so easy and convenient.","Docker Desktop is an application for MacOS and Windows machines for the building and sharing of containerized applications. Access Docker Desktop and follow the guided onboarding to build your first containerized application in minutes.","Organize all your team’s content, tune out distractions, and get everyone coordinated with the world’s first smart workspace.","Organize all your team’s content, tune out distractions, and get everyone coordinated with the world’s first smart workspace.","Eraser is an advanced security tool for Windows which allows you to completely remove sensitive data from your hard drive by overwriting it several times with carefully selected patterns.","FastCopy is the Fastest Copy/Backup Software on Windows","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","A UWP Spotify client","Yet another typical ZIP archiver","Bitwarden is a free and open source password manager for individuals, teams, and business organizations.","Blender is the free and open source 3D creation suite. It supports the entirety of the 3D pipeline—modeling, rigging, animation, simulation, rendering, compositing and motion tracking, video editing and 2D animation pipeline.","Brutal Chess features full 3D graphics, an advanced particle engine, and several different levels of intelligent AI, inspired by the once popular \"Battle Chess\" released by Interplay circa 1988.","The Most Feature Rich Chromium","MiKTeX (pronounced mick-tech) is an up-to-date implementation of TeX/LaTeX and related programs. TeX is a typesetting system written by Donald Ervin Knuth who says that it is intended for the creation of beautiful books - and especially for books that contain a lot of mathematics.","LICEcap can capture an area of your desktop and save it directly to .GIF","Termite is an easy to use and easy to configure RS232 terminal. It uses an interface similar to that of \"messenger\" or \"chat\" programs, with a large window that contains all received data and an edit line for typing in strings to transmit.","Barrier Setup","Deezer is a French online music streaming service.","iMazing lets you transfer music, files, messages, apps and more from any iPhone, iPad, or iPod to a computer, Mac or PC. Manage and backup your iOS device simply without iTunes. (was DiskAid)","Ebbflow Client and Proxy","Colobot: Gold Edition is a real-time strategy game, where you can program your units (bots) in a language called CBOT, which is similar to C++ and Java. Your mission is to find a new planet to live and survive. You can save the humanity and get programming skills!","Miniconda is a free minimal installer for conda.","Powerful and intelligent flash cards","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","Remote Connections & Passwords. Everywhere!","Docker Desktop is an application for MacOS and Windows machines for the building and sharing of containerized applications. Access Docker Desktop and follow the guided onboarding to build your first containerized application in minutes.","Dolphin is an emulator for two recent Nintendo video game consoles: the GameCube and the Wii. It allows PC gamers to enjoy games for these two consoles in full HD (1080p) with several enhancements: compatibility with all PC controllers, turbo speed, networked multiplayer, and even more!","A lightweight, versatile image viewer","Free and multifunctional, multimedia file processing tools.","Community-driven, Vendor-neutral build of OpenJDK for Windows x64.","1Password remembers all your passwords for you, and keeps them safe and secure behind the one password that only you know.","This application can monitor and visualize your processors temperature","A freeware resource compiler & decompiler for Windows® applications","BPBible is a flexible Bible Study tool made using the SWORD project, Python and wxPython. It is absolutely free and designed to be easy to use.","TrayStatus shows you the status of keyboard keys like Caps Lock, Num Lock, Scroll Lock, Alt, Ctrl, and more, right in your system tray.","VoiceBot lets you take command with your voice! Say commands out loud to send actions to your games and applications. Use your voice to type keyboard shortcuts, click and move your mouse, and execute macros and scripts.","Secure, Fast & Private Web Browser with Adblocker","iCUE unites all of your compatible CORSAIR components and devices, making your PC greater than the sum of its parts","Remote Connections & Passwords. Everywhere!","Ditto is an extension to the standard windows clipboard. It saves each item placed on the clipboard allowing you access to any of those items at a later time.","Doxie is a portable scanner for going paperless","dupeGuru is a cross-platform (Linux, OS X, Windows) GUI tool to find duplicate files in a system","High-speed arctic racing game based on Tux Racer","Reliable and free network scanner to analyse LAN.","Files UWP is a modern File Explorer app for Windows.","Freeciv is a Free and Open Source empire-building strategy game inspired by the history of human civilization.","GOG GALAXY 2.0 allows you to combine multiple game libraries into one and connect with your friends across all gaming platforms, consoles included!","free and open source test automation framework that takes the pain out of acceptance testing","Free and open source file archiver with a high compression ratio.","Cube is an open source multiplayer and singleplayer first person shooter game built on an entirely new and very unconventional engine. Cube is a landscape-style engine that pretends to be an indoor FPS engine, which combines very high precision dynamic occlusion culling with a form of geometric mipmapping on the whole world for dynamic LOD for configurable fps & graphic detail on most machines. Uses OpenGL & SDL.","A light, Electron-based wrapper around GraphiQL.","With focused visual tools and preprocessor support, Brackets is a modern text editor that makes it easy to design in the browser. It's crafted from the ground up for web designers and front-end developers.","flash-player-npapi","1Password remembers all your passwords for you, and keeps them safe and secure behind the one password that only you know.","No-cost, multiplatform, production-ready distribution of the Open Java Development Kit (OpenJDK).","An interpreter for the PostScript language and for PDF.","BeeBEEP is the office messaging application that does not need an external server to let users communicate with each other.","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","View the window class, text, properties, and more, simply by moving your mouse cursor over the target window.","Blender is the free and open source 3D creation suite. It supports the entirety of the 3D pipeline—modeling, rigging, animation, simulation, rendering, compositing and motion tracking, video editing and 2D animation pipeline.","Bluefish is a powerful editor targeted towards programmers and webdevelopers, with many options to write websites, scripts and programming code. Bluefish supports many programming and markup languages.","Xming is the leading X Window System Server for Microsoft Windows®","WinZip Compression Utility","A HDD/SSD utility software which supports a part of USB, Intel/AMD RAID and NVMe.","A HDD/SSD utility software which supports a part of USB, Intel/AMD RAID and NVMe.","CrystalDiskMark is a simple disk benchmark software.","Seq is the easiest way for development teams to capture, search and visualize structured log events.","Instant Remote Support & Remote Desktop","DjVu is a web-centric format for distributing documents and images. DjVu was created at AT&T Labs-Research and later sold to LizardTech Inc. DjVuLibre is a GPL implementation of DjVu maintained by the original inventors of DjVu.","KeePass, the free, open source, light-weight and easy-to-use password manager.","free PDF Writer","The 3D Interior Design Software for Experts.","Epic Games Launcher for the Epic Games Store and Unreal Engine","Evernote helps you focus on what matters most and have access to your information when you need it. Input typed notes or scan handwritten notes. Add to-do’s, photos, images, web pages, or audio ... and it’s all instantly searchable. Organize notes any way you want and share with anyone. And Evernote syncs across your devices so your information is always with you, everywhere you go.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","Universal Command Line Interface for Amazon Web Services","The Kindle app is available for most major smartphones, tablets and computers. That means with our free Kindle reading apps, you can buy a Kindle book once, and read it on any device with the Kindle app installed*. You can also read that same Kindle book on a Kindle device if you own one.","An easy-to-use, multi-track audio editor and recorder.","Flash OS images to SD cards and USB drives, safely and easily.","Yet another typical ZIP archiver","Yet another typical ZIP archiver","Betaflight Configurator is a crossplatform configuration tool for the Betaflight flight control system.","Copay is a secure Bitcoin and Bitcoin Cash wallet platform for both desktop and mobile devices","Caprine is an elegant Facebook Messenger desktop app","Free open-source C/C++/Fortran IDE (includes additional GCC/G++ compiler and GDB debugger)","C-Dogs SDL is a classic overhead run-and-gun game, supporting up to 4 players in co-op and deathmatch modes. Customize your player, choose from many weapons, and blast, slide and slash your way through over 100 user-created campaigns. Have fun!","InternetOff is a free tool that allows you to quickly turn off\\on your internet connection from the system tray","Dave Gnukem is an open source retro-style 2D scrolling platform shooter, inspired by and similar to Duke Nukem 1.","The window manager you didn't know you missed. Divide your screen, increase your productivity.","Docker Desktop is an application for MacOS and Windows machines for the building and sharing of containerized applications. Access Docker Desktop and follow the guided onboarding to build your first containerized application in minutes.","The easiest way to get started with Electron","Evernote helps you focus on what matters most and have access to your information when you need it. Input typed notes or scan handwritten notes. Add to-do’s, photos, images, web pages, or audio ... and it’s all instantly searchable. Organize notes any way you want and share with anyone. And Evernote syncs across your devices so your information is always with you, everywhere you go.","EarTrumpet is a powerful volume control app for Windows","Files UWP is a modern File Explorer app for Windows","A fast and friendly git client for Mac and Windows.","Industry’s Most Powerful PDF Reader.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","File Converter is a very simple tool which allows you to convert and compress one or several file(s) using the context menu in windows explorer.","A lightweight client for managing MariaDB, MySQL, SQL Server, PostgreSQL and SQLite, written in Delphi","AnyDesk is a German proprietary remote desktop tool distributed by AnyDesk Software GmbH.","iTunes is a media player developed by Apple that also can be used to communicate with Apple mobile devices","Simply Fortran is a complete Fortran solution for Microsoft Windows. The package includes a configured Fortran compiler installation, an integrated development environment, and a graphical debugger.","DisplayFusion will make your multi-monitor life much easier! With powerful features like Multi-Monitor Taskbars, TitleBar Buttons and fully customizable HotKeys, DisplayFusion will make managing your multiple monitors easy.","CDBurnerXP is a free application to burn CDs and DVDs, including Blu-Ray and HD-DVDs. It also includes the feature to burn and create ISOs, as well as a multilanguage interface. Everyone, even companies, can use it for free.","This package contains the Dell Update application that supports Win32. Dell Update application automatically updates critical fixes and important device drivers as they become available.","Easy your downloads, Get everything done!","Turn your mobile phone or tablet into a set of wireless mouse, keyboard and trackpad.","Empoche combines time tracking and task management in an unique new way. Learn where you lose time and get more productive.","FastCopy is the Fastest Copy/Backup Software on Windows","MailWasher lets you preview all your email before it gets to your computer, enabling you to read all your email securely, and instantly delete any unwanted or suspicious email.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","GNU Radio is a free & open-source software development toolkit that provides signal processing blocks to implement software radios. It can be used with readily-available low-cost external RF hardware to create software-defined radios, or without hardware in a simulation-like environment. It is widely used in research, industry, academia, government, and hobbyist environments to support both wireless communications research and real-world radio systems.","GOG GALAXY 2.0 allows you to combine multiple game libraries into one and connect with your friends across all gaming platforms, consoles included!","Robo 3T (formerly Robomongo *) is a shell-centric cross-platform MongoDB management tool. Unlike most other MongoDB admin UI tools, Robo 3T embeds the actual mongo shell in a tabbed interface with access to a shell command line as well as GUI interaction.","Spek helps to analyse your audio files by showing their spectrogram.","A lightweight client for managing MariaDB, MySQL, SQL Server, PostgreSQL and SQLite, written in Delphi","SoundSwitch offers you the opportunity to switch your playback and recording devices using simple hotkeys.","Git GUI Client.","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","FileSeek is an easy-to-use file search app that includes advanced functionality for power users! Search through files using simple queries or regular expressions. You can even sync your search settings between computers.","Battle.NET is Blizzard Entertainement & Activision Games Launcher","This application is intended for creating and managing X.509 certificates, certificate requests, RSA, DSA and EC private keys, Smartcards and CRLs.","ClamWin is a Free Antivirus program for Microsoft Windows 10 / 8 / 7 / Vista / XP / Me / 2000 / 98 and Windows Server 2012, 2008 and 2003.","The Enterprise edition (EE) represents the latest, most stable, production-ready release of Couchbase Server. We recommend the Enterprise Edition binaries for commercial production systems running Couchbase Server. The Enterprise Edition contains some unique features that make it the best fit for production deployments running in data centers or a public cloud infrastructure. Use of EE in development and test environments is free. EE requires a paid subscription for production use. Our paid annual subscriptions for EE include a commercial license, better availability capabilities, enhanced security features, advanced tooling and higher performance and scale. It also includes technical support with service level commitments via our 24x7 support organization and hot fixes for releases. One important principle for CE and EE is to ensure full portability of applications between two editions. The capabilities ensure that an application running on EE should simply transition to CE without code changes and visa versa.","Cppcheck is a static analysis tool for C/C++ code. Unlike C/C++ compilers and many other analysis tools it does not detect syntax errors in the code. Cppcheck primarily detects the types of bugs that the compilers normally do not detect. The goal is to detect only real errors in the code (i.e. have zero false positives).","Free multi-platform database tool for developers, database administrators, analysts and all people who need to work with databases. Supports all popular databases (MySQL, PostgreSQL, SQLite, Oracle, DB2, SQL Server, Sybase, MS Access, Teradata, Firebird, Apache Hive, Phoenix, Presto, etc)","An audio player which tries to make organizing and listening to music as simple and pretty as possible.","Organize all your team’s content, tune out distractions, and get everyone coordinated with the world’s first smart workspace.","Esteem desktop application reimagined for Windows, Mac, Linux users, start earning cryptocurrency!","Fast, stable, user-friendly image browser, converter and editor","Torrex modern bittorrent client.","FlightGear is an open-source flight simulator.","An extensible, customizable, free/libre text editor - and more.","npm desktop manager","AdoptOpenJDK with Oracle HotSpot JVM","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","LogFusion is a powerful realtime log monitoring application designed for system administrators and developers! Use custom highlighting rules, filtering and more. You can even sync your LogFusion settings between computers.","Video Game Streaming Service","HttpMaster Professional is a professional testing tool for HTTP applications, with special focus on RESTful web services and web API applications.","Streamline your workflow and get more done","Cozy Drive is a synchronization tool for your files and folders with Cozy Cloud.","CrystalDiskMark is a simple disk benchmark software.","Deluge is a lightweight, Free Software, cross-platform BitTorrent client.","Dixa Desktop app for Windows and Mac","Docker Desktop is an application for MacOS and Windows machines for the building and sharing of containerized applications. Access Docker Desktop and follow the guided onboarding to build your first containerized application in minutes.","Universal Command Line Interface for Amazon Web Services","A lightweight client for managing MariaDB, MySQL, SQL Server, PostgreSQL and SQLite, written in Delphi","SoundSwitch offers you the opportunity to switch your playback and recording devices using simple hotkeys.","Apache OpenOffice is the leading open-source office software suite for word processing, spreadsheets, presentations, graphics, databases and more. It is available in many languages and works on all common computers. It stores all your data in an international open standard format and can also read and write files from other common office software packages. It can be downloaded and used completely free of charge for any purpose.","XAMPP is an easy to install Apache distribution containing MariaDB, PHP and Perl.","A UWP Spotify client","Simplenote is an easy way to keep notes, lists, ideas and more. Your notes stay in sync with all your devices for free.","A control panel for all your WordPress sites.","3D multiplayer tank battle game","Bloodshed Dev-C++ is a full-featured Integrated Development Environment (IDE) for the C/C++ programming language. It uses Mingw port of GCC (GNU Compiler Collection) as it's compiler. Dev-C++ can also be used in combination with Cygwin or any other GCC based compiler.","Buttercup is a password manager - an assistant for helping you store all of your login credentials. Buttercup helps you keep your accounts safe and assists you when you want to log in - all you need to do is remember just one password: your master password.","HWMonitor is a hardware monitoring program that reads PC systems main health sensors.","Design and share circuit diagrams using a wide range of components.","Contasimple is the leading invoicing, accounting and taxes application to manage your company on the cloud","A HDD/SSD utility software which supports a part of USB, Intel/AMD RAID and NVMe.","Zentimo is an USB & SATA device manager","Cross-Platform Software-Defined Radio Application","Dungeon Crawl Stone Soup is a free and open source roguelike computer game, which is the actively community-developed successor of the 1997 roguelike game Linley's Dungeon Crawl, originally programmed by Linley Henzell.","DOSBox is an emulator program which emulates an IBM PC compatible computer running a DOS operating system.","Display Information on Das Keyboard Q RGB Devices","Docker Desktop is an application for MacOS and Windows machines for the building and sharing of containerized applications. Access Docker Desktop and follow the guided onboarding to build your first containerized application in minutes.","Grindstone is a free app that lets you easily and accurately keep track of your time.","Files UWP is a modern File Explorer app for Windows","FontForge is a free and open source font editor brought to you by a community of fellow type lovers.","Katawa Shoujo is an adult bishoujo-style visual novel set in the fictional Yamaku High School for disabled children, located somewhere in modern Japan. Hisao Nakai, a normal boy living a normal life, has his life turned upside down when a congenital heart defect forces him to move to a new school after a long hospitalization. Despite his difficulties, Hisao is able to find friends—and perhaps love, if he plays his cards right. There are five main paths corresponding to the 5 main female characters, each path following the storyline pertaining to that character.","Algodoo is a unique 2D-simulation software from Algoryx Simulation AB. Algodoo is designed in a playful, cartoony manner, making it a perfect tool for creating interactive scenes. Explore physics, build amazing inventions, design cool games or experiment with Algodoo in your science classes. Algodoo encourages students and children’s own creativity, ability and motivation to construct knowledge while having fun. Making it as entertaining as it is educational. Algodoo is also a perfect aid for children to learn and practice physics at home.","Universal Command Line Interface for Amazon Web Services","No-cost, multiplatform, production-ready distribution of the Open Java Development Kit (OpenJDK).","A lightweight client for managing MariaDB, MySQL, SQL Server, PostgreSQL and SQLite, written in Delphi","Automatically switches between the dark and light theme of Windows 10 at scheduled times","RenderDoc is a free MIT licensed stand-alone graphics debugger that allows quick and easy single-frame capture and detailed introspection of any application using Vulkan, D3D11, OpenGL & OpenGL ES or D3D12 across Windows 7 - 10, Linux, Android, Stadia, or Nintendo Switch.","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","Liberica JDK is available on a variety of platforms. It is built from OpenJDK which BellSoft contributes to and is thoroughly tested.\nLiberica JDK is compatible with the Java SE standard as confirmed by the JCK provided under the license from OpenJDK. Support options are available from BellSoft.\n","Caprine is an elegant Facebook Messenger desktop app","The next generation music client","Lightscreen Setup","USB Safely Remove is a unique tool to improve safe removal for USB and SATA gadgets","Discord is the easiest way to communicate over voice, video, and text, whether you’re part of a school club, a nightly gaming group, a worldwide art community, or just a handful of friends that want to hang out.","Discord is the easiest way to communicate over voice, video, and text. Chat, hang out, and stay close with your friends and communities.","Easy your downloads, Get everything done!","Eraser is an advanced security tool for Windows which allows you to completely remove sensitive data from your hard drive by overwriting it several times with carefully selected patterns.","A terminal for a more modern age.","GIMP is an acronym for GNU Image Manipulation Program. It is a freely distributed program for such tasks as photo retouching, image composition and image authoring.","Git version control system.","A hackable text editor for the 21st Century, free and open source.","Focus on what matters instead of fighting with Git. Whether you're new to Git or a seasoned user, GitHub Desktop simplifies your development workflow.","GitHub's official command-line tool.","Zip is a compression and file packaging/archive utility. Although \\highly compatible both with PKWARE's PKZIP and PKUNZIP utilities for MS-DOS and with Info-ZIP's own UnZip, our primary objectives have been portability and other-than-MSDOS functionality.","A fast, secure, and free web browser built for the modern web. Chrome syncs bookmarks across all your devices, fills out forms automatically, and so much more.","Solve math problems, graph functions, create geometric constructions, do statistics and calculus, save and share your results. GeoGebra apps are used by millions of students and teachers around the world to learn and teach mathematics and science.","PeaZip is a free and open-source file manager and file archiver for Microsoft Windows, Linux and BSD made by Giorgio Tani. It supports its native PEA archive format and other mainstream formats, with special focus on handling open formats. It supports 210 file extensions.","A hackable text editor for the 21st Century, free and open source.","GNU Wget is a free network utility to retrieve files from the World Wide Web using HTTP and FTP, the two most widely used Internet protocols. It works non-interactively, thus enabling work in the background, after having logged off.","Personal and small-business financial-accounting software","A fast, secure, and free web browser built for the modern web. Chrome syncs bookmarks across all your devices, fills out forms automatically, and so much more.","Mounts Google Drive(s) as a share drive and streams files as needed from the cloud. Alternative to Google Backup and Sync.","GraphQL IDE for better development workflows (GraphQL Subscriptions, interactive docs & collaboration)","Construct circles, angles, transformations and more with our free geometry tool","Graph functions, investigate equations, and plot data with the free graphing app","The world's most detailed globe. Create maps with advanced tools.","Grafana allows you to query, visualize, alert on and understand your metrics no matter where they are stored. Create, explore, and share dashboards with your team and foster a data driven culture.","Go is an open source programming language that makes it easy to build simple, reliable, and efficient software.","A powerful, stable and lightweight programmer's text editor that provides tons of useful features without bogging down your workflow.","Git Extensions is a graphical user interface for Git that allows you to control Git without using the commandline","GitHub's official command-line tool.","Digital Audio Editing Software","Solve math problems, graph functions, create geometric constructions, do statistics and calculus, save and share your results. GeoGebra apps are used by millions of students and teachers around the world to learn and teach mathematics and science.","Apps bundle including free tools for geometry, spreadsheet, probability, and CAS","Free and open-source file archiver utility that supports 180+ archive formats.","A hackable text editor for the 21st Century, free and open source.","Focus on what matters instead of fighting with Git. Whether you're new to Git or a seasoned user, GitHub Desktop simplifies your development workflow.","Grep searches one or more input files for lines containing a match to a specified pattern. By default, grep prints the matching lines.","Graph functions, investigate equations, and plot data with the free graphing app","Focus on what matters instead of fighting with Git. Whether you're new to Git or a seasoned user, GitHub Desktop simplifies your development workflow.","Go is an open source programming language that makes it easy to build simple, reliable, and efficient software.","Grafana allows you to query, visualize, alert on and understand your metrics no matter where they are stored. Create, explore, and share dashboards with your team and foster a data driven culture.","Git version control system.","Git Large File Storage  is a command line extension and specification for managing large files with Git.","Go is an open source programming language that makes it easy to build simple, reliable, and efficient software.","Mounts Google Drive(s) as a share drive and streams files as needed from the cloud. Alternative to Google Backup and Sync.","Solve math problems, graph functions, create geometric constructions, do statistics and calculus, save and share your results. GeoGebra apps are used by millions of students and teachers around the world to learn and teach mathematics and science.","Solve math problems, graph functions, create geometric constructions, do statistics and calculus, save and share your results. GeoGebra apps are used by millions of students and teachers around the world to learn and teach mathematics and science. Join us: Dynamic Mathematics for everyone!","Construct circles, angles, transformations and more with our free geometry tool","GitHub's official command-line tool.","A feature-rich dictionary lookup program, supporting multiple dictionary formats (StarDict/Babylon/Lingvo/Dictd) and online dictionaries, featuring perfect article rendering with the complete markup, illustrations and other content retained, and allowing you to type in words without any accents or correct case.","Find the right subtitles. Easy.","A fast, secure, and free web browser built for the modern web. Chrome syncs bookmarks across all your devices, fills out forms automatically, and so much more.","Total Commander is a Shareware file manager for Windows® 95/98/ME/NT/2000/XP/Vista/7/8/8.1/10, and Windows® 3.1.","Git version control system.","Focus on what matters instead of fighting with Git. Whether you're new to Git or a seasoned user, GitHub Desktop simplifies your development workflow.","Make is a tool which controls the generation of executables and other non-source files of a program from the program's source files. Make gets its knowledge of how to build your program from a file called the makefile, which lists each of the non-source files and how to compute it from other files. When you write a program, you should write a makefile for it, so that it is possible to use Make to build and install the program.","Go is an open source programming language that makes it easy to build simple, reliable, and efficient software.","A fast, secure, and free web browser built for the modern web. Chrome syncs bookmarks across all your devices, fills out forms automatically, and so much more.","Git Extensions is a graphical user interface for Git that allows you to control Git without using the commandline","Go is an open source programming language that makes it easy to build simple, reliable, and efficient software.","Git version control system.","A fast, secure, and free web browser built for the modern web. Chrome syncs bookmarks across all your devices, fills out forms automatically, and so much more.","Great IM Client for Github","A hierarchical note taking application, featuring rich text and syntax highlighting, storing data in a single xml or sqlite file.","Glimpse is an open source image editor based on the GNU Image Manipulation Program. The goal is to experiment with new ideas and expand the use of free software.","Every person has their own story but they are also part of a collective family history. Gramps gives you the ability to record the many details of an individual’s life as well as the complex relationships between various people, places and events. All of your research is kept organized, searchable and as precise as you need it to be.","Visualization and exploration of grpahs and networks","A hackable text editor for the 21st Century, free and open source.","Grafana allows you to query, visualize, alert on and understand your metrics no matter where they are stored. Create, explore, and share dashboards with your team and foster a data driven culture. The Enterprise Edition has the same features as the Open Source Edition and can be used free of charge. It also has the benefit of allowing an upgrade to the full Enterprise feature set, including support for Enterprise plugins.","Grafana allows you to query, visualize, alert on and understand your metrics no matter where they are stored. Create, explore, and share dashboards with your team and foster a data driven culture. The Enterprise Edition has the same features as the Open Source Edition and can be used free of charge. It also has the benefit of allowing an upgrade to the full Enterprise feature set, including support for Enterprise plugins.","MakeMKV is your one-click solution to convert video that you own into free and patents-unencumbered format that can be played everywhere.","Link Shell Extension (LSE) provides for the creation of Hardlinks, Junctions, Volume Mountpoints, and Symbolic Links, (herein referred to collectively as Links) a folder cloning process that utilises Hardlinks or Symbolic Links and a copy process taking care of Junctions, Symbolic Links, and Hardlinks. LSE, as its name implies is implemented as a Shell extension and is accessed from Windows Explorer, or similar file/folder managers.","IRCCloud Desktop App","Inno Setup is a free installer for Windows programs by Jordan Russell and Martijn Laan. First introduced in 1997, Inno Setup today rivals and even surpasses many commercial installers in feature set and stability.","Graphical interface for the Appium server, and an app inspector","Graphical application for managing bibtex (.bib) libraries.","a universal document converter","Kdenlive is an acronym for KDE Non-Linear Video Editor. It is primarily aimed at the GNU/Linux platform but also works on BSD and MacOS. It is currently being ported to Windows as a GSOC project.","The Vulkan SDK provides Vulkan application developers with essential tools to accelerate the development process.","Mute background noise in any communication app","LMMS is a free cross-platform alternative to commercial programs like FL Studio®, which allow you to produce music with your computer. This includes the creation of melodies and beats, the synthesis and mixing of sounds, and arranging of samples. You can have fun with your MIDI-keyboard and much more; all in a user-friendly and modern interface.","Malwarebytes protects you against malware, ransomware, malicious websites, and other advanced online threats.","Windows desktop tool to test accessibility of Windows applications","The Azure command-line interface (Azure CLI) is a set of commands used to create and manage Azure resources. The Azure CLI is available across Azure services and is designed to get you working quickly with Azure, with an emphasis on automation.","Bot Framework Composer is an integrated development tool for developers and multi-disciplinary teams to build bots and conversational experiences with the Microsoft Bot Framework. Within this tool, you'll find everything you need to build a sophisticated conversational experience.","An open-source implementation of the Python programming language which is tightly integrated with the .NET Framework.","Microsoft's simplified variant of the BASIC programming language, intended as an easy programming language for beginners.","The Microsoft Visual C++ 2008 SP1 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2008 SP1 on a computer that does not have Visual C++ 2008 SP1 installed.","The Microsoft Visual C++ 2008 SP1 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 32-bit applications developed with Visual C++ 2008 SP1 on a computer that does not have Visual C++ 2008 SP1 installed.","The Microsoft Visual C++ 2017 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2017 on a computer that does not have Visual C++ 2017 installed.","By using Microsoft Visio 2016 Viewer, Visio users can freely distribute Visio drawings (files with a .vsdx, .vsdm, .vsd, .vdx, .vdw, .vstx, .vstm, .vst, or .vtx extension) to team members, partners, customers, or others, even if the recipients do not have Visio installed on their computer.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Windows Terminal is a modern terminal application for users of command line tools and shells like Command Prompt, PowerShell, and Windows Subsystem for Linux (WSL). Its main features include multiple tabs, panes, Unicode and UTF-8 character support, a GPU accelerated text rendering engine, and the ability to create your own themes and customize text, colors, backgrounds, and shortcut key bindings.","Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.","Mullvad is an open-source commercial virtual private network service based in Sweden.","an open source and free music notation software","Communicate the way you want with Riot - a universal secure chat app entirely under your control","Natural node.js and npm version manager for windows.","GeForce Experience takes the hassle out of PC gaming by configuring your game’s graphics settings for you.","Opera browser for computers","Host media content in Plex Media Server.","Python is a programming language that lets you work more quickly and integrate your systems more effectively.","Plan for today and tomorrow with one solution to manage all your finances.","Comprehensive Hardware Analysis, Monitoring and Reporting for Windows and DOS.","The base binary distribution of R statistics language.","Manage multiple rust installations with ease","DYMO Connect for Desktop enables the creation and printing of labels for LabelWriter 450 series/4XL and LabelManager printers.","The WPF Spy Utility","The OpenVPN Configuration Generator is designed to make generating server and client configurations for an OpenVPN server and Viscosity easier.","Spotify music player","Bob the Hamster is a spiffy game, inspired by old arcade classics like `Dig Dug' and `Mr. Do'. Choose to play as Bob the Hamster and gather carrots, or as Vlad the Hamster and smite foes. Playable in both English and Japanese text modes.","The Collaborative API Design Tool for designing and managing OpenAPI specs.","A graphical NBT editor for all Minecraft NBT data sources.","End-to-end encryption for things that matter. Keybase is secure messaging and file-sharing.","The LLVM Compiler Infrastructure","A simple and elegant open-source markdown editor that focused on speed and usability.","Maxthon 5 Cloud Browser. This time is not change but evolution. Maxthon 5 cloud browser, innovate your browser world view.","The Azure command-line interface (Azure CLI) is a set of commands used to create and manage Azure resources. The Azure CLI is available across Azure services and is designed to get you working quickly with Azure, with an emphasis on automation.","Azure Data Studio is a data management tool that enables you to work with SQL Server, Azure SQL DB and SQL DW from Windows, macOS and Linux.","PowerShell is a cross-platform (Windows, Linux, and macOS) automation and configuration tool/framework that works well with your existing tools and is optimized for dealing with structured data (e.g. JSON, CSV, XML, etc.), REST APIs, and object models. It includes a command-line shell, an associated scripting language and a framework for processing cmdlets.","SQL Server Management Studio (SSMS) is an integrated environment for managing any SQL infrastructure, from SQL Server to Azure SQL Database. SSMS provides tools to configure, monitor, and administer instances of SQL Server and databases. Use SSMS to deploy, monitor, and upgrade the data-tier components used by your applications, and build queries and scripts.","The Update Assistant can help you update to the latest version of Windows 10.  Windows 10 May 2020 Update","The Microsoft Visual C++ 2010 SP1 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2010 SP1 on a computer that does not have Visual C++ 2010 SP1 installed.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","The new Windows Terminal and the original Windows console host, all in the same place!","Windows Terminal is a modern terminal application for users of command line tools and shells like Command Prompt, PowerShell, and Windows Subsystem for Linux (WSL). Its main features include multiple tabs, panes, Unicode and UTF-8 character support, a GPU accelerated text rendering engine, and the ability to create your own themes and customize text, colors, backgrounds, and shortcut key bindings.","XML Notepad is a lightweight and fast tool for editing XML documents.","The best browser with fast site rendering, advanced privacy, a sleek design and innovative features.","Firefox Developer Edition is the blazing fast browser that offers cutting edge developer tools and latest features like CSS Grid support and framework debugging","Arcade racing game with built-in track editor","A modern, lightweight text editor with a minimalist design.","QGIS is a user friendly Open Source Geographic Information System (GIS) licensed under the GNU General Public License. QGIS is an official project of the Open Source Geospatial Foundation (OSGeo). It runs on Linux, Unix, Mac OSX, Windows and Android and supports numerous vector, raster, and database formats and functionalities.","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","Free video downloader for sites such as YouTube and TikTok.","FlashFXP is a FTP, FTPS, SFTP client for Windows. Secure, reliable, and efficient file transfers.","The MySQL software delivers a very fast, multithreaded, multi-user, and robust SQL (Structured Query Language) database server. MySQL Server is intended for mission-critical, heavy-load production systems as well as for embedding into mass-deployed software.","PDFsam Basic or PDF Split and Merge is a free and open-source cross-platform desktop application to split, merge, extract pages, rotate and mix PDF documents.","CCleaner Installer","Bring macOS “Quick Look” feature to Windows","Rocket.Chat is the leading open source team chat software solution. Free, unlimited and completely customizable with on-premises and SaaS cloud hosting.","A free and universal communication platform which preserves the user's privacy and freedoms.","Easy to use and elegant Multimedia converter.","Slack brings the team together, wherever you are.","Slack brings the team together, wherever you are.","The WPF Spy Utility","A high-precision scientific calculator featuring a fast, keyboard-driven user interface.","A word processor for handwriting.","Industrial Strength Windows Installer XML ( IsWiX ) makes authoring Windows Installer XML (WiX) Windows Installers (.MSI) a breeze. It includes Visual Studio project templates and graphical designers to aid you in authoring 95% of your source code. From there you can author additional code using standard WiX programming techniques.","Joplin for Desktop","Lisk Hub","Bash's powerful command line editing in cmd.exe http://mridgers.github.io/clink","Better font rendering for Windows.","Azure Data Studio is a data management tool that enables you to work with SQL Server, Azure SQL DB and SQL DW from Windows, macOS and Linux.","Azure Data Studio is a data management tool that enables you to work with SQL Server, Azure SQL DB and SQL DW from Windows, macOS and Linux.","World-class performance with more privacy, more productivity, and more value while you browse.","Mouse without Borders (http://aka.ms/mm) is a product that makes you the captain of your computer fleet by allowing you to control up to four computers from a single mouse and keyboard. This means that with Mouse without Borders you can copy text or drag and drop files across computers.","Microsoft Teams is the hub for team collaboration in Microsoft 365 that integrates the people, content, and tools your team needs to be more engaged and effective.","The Microsoft Visual C++ 2012 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 32-bit applications developed with Visual C++ 2012 on a computer that does not have Visual C++ 2012 installed.","The Microsoft Visual C++ 2017 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 32-bit applications developed with Visual C++ 2017 on a computer that does not have Visual C++ 2017 installed.",".NET Core is an open-source, general-purpose development platform. You can create .NET Core apps for Windows, macOS, and Linux for x64, x86, ARM32, and ARM64 processors using multiple programming languages. Frameworks and APIs are provided for cloud, IoT, client UI, and machine learning.","Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.","Firefox Developer Edition is the blazing fast browser that offers cutting edge developer tools and latest features like CSS Grid support and framework debugging","Low-latency and high quality voice chat primarily intended for use while gaming.","Screen, webcam and sketchboard recorder with an integrated editor.","Professional open source video editor","Integrated Development Environment for the OutSystems Platform.","Game launcher for selected Paradox games. Connect your Paradox account to your steam account and get access directly through Paradox.","MSIX Commander is a Toolkit with multiple nice features for packaging engineers","Boost performance by reassembling fragmented files","Host media content in Plex Media Server.","A utility that helps format and create bootable USB flash drives.","Google Play Music Desktop Player","Signal is an encrypted communications application. It uses the Internet to send one-to-one and group messages, which can include files, voice notes, images and videos, and make one-to-one voice and video calls.","Autopsy is the premier end-to-end open source digital forensics platform.","Free Download Manager (FDM for short) is a free, efficient, and comprehensive solution for managing all your downloads.","Control all your speakers, group rooms to play in sync, and quickly search for music and more.","The Heroku Command Line Interface (CLI) makes it easy to create and manage your Heroku apps directly from the terminal. It’s an essential part of using Heroku.","Professional vector graphics editor","As the Iometer User's Guide says, Iometer is an I/O subsystem measurement and characterization tool for single and clustered systems. It was originally developed by the Intel Corporation and announced at the Intel Developers Forum (IDF) on February 17, 1998 - since then it got wide spread within the industry.","Joplin is a free, open source note taking and to-do application, which can handle a large number of notes organised into notebooks.","Krita is a professional FREE and open source painting program. It is made by artists that want to see affordable art tools for everyone.","PyMODA is a Python implementation of MODA (Multiscale Oscillatory Dynamics Analysis), a numerical toolbox developed by the Nonlinear & Biomedical Physics group at Lancaster University and the Nonlinear Dynamics and Synergetic Group at the Faculty of Electrical Engineering, University of Ljubljana, Slovenia under the supervision of Aneta Stefanovska.","LastPass is a freemium password manager that stores encrypted passwords online.","Mattermost Desktop application for Windows","Command line tools for Azure Functions","Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experience for greater productivity. Inspired by the Windows 95 era PowerToys project, this reboot provides power users with ways to squeeze more efficiency out of the Windows 10 shell and customize it for individual workflows.","Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experience for greater productivity. Inspired by the Windows 95 era PowerToys project, this reboot provides power users with ways to squeeze more efficiency out of the Windows 10 shell and customize it for individual workflows.","SQL Server Management Studio (SSMS) is an integrated environment for managing any SQL infrastructure, from SQL Server to Azure SQL Database. SSMS provides tools to configure, monitor, and administer instances of SQL Server and databases. Use SSMS to deploy, monitor, and upgrade the data-tier components used by your applications, and build queries and scripts.","SQL Server Management Studio (SSMS) is an integrated environment for managing any SQL infrastructure, from SQL Server to Azure SQL Database. SSMS provides tools to configure, monitor, and administer instances of SQL Server and databases. Use SSMS to deploy, monitor, and upgrade the data-tier components used by your applications, and build queries and scripts.","Microsoft Teams is the hub for team collaboration in Microsoft 365 that integrates the people, content, and tools your team needs to be more engaged and effective.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Preview version of the .NET Core SDK.","This is a keystroke launcher for Windows and macOS.","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","Fast, lightweight, advanced system information at your fingertips","Postbox is the power email app for busy professionals, like you.","i2pd (I2P Daemon) is a full-featured C++ implementation of I2P client. I2P (Invisible Internet Protocol) is a universal anonymous network layer. All communications over I2P are anonymous and end-to-end encrypted, participants don't reveal their real IP addresses.","this is the rust-lang built with gnu toolchain","Prevents the Windows 10 sleep mode while you're running a download, backup or any other process.","Strawberry Perl is a perl environment for MS Windows containing all you need to run and develop perl applications. It is designed to be as close as possible to perl environment on UNIX systems.","Free and open source streaming software built on OBS and Electron.","Use ImageMagick® to create, edit, compose, or convert bitmap images.","Calculate and display hash values from over two dozen popular hashing algorithms","The Intel® Driver & Support Assistant enables you to scan computing devices for the latest drivers available from Intel.","CMake is a cross-platform, open-source build system generator.","Design virtual models you can build with LEGO(R) bricks","AutoHotkey is a free, open-source scripting language for Windows that allows users to easily create small to complex scripts for all kinds of tasks such as: form fillers, auto-clicking, macros, etc.","LibreOffice is a free and powerful office suite, and a successor to OpenOffice.org (commonly known as OpenOffice). Its clean interface and feature-rich tools help you unleash your creativity and enhance your productivity.","LibreOffice The Document Foundation","Password manager web browser extension.","Logitech Gaming Software lets you customize Logitech G gaming mice, keyboards, headsets and select wheels","CertAid manages the entire MIT personal certificate setup procedure, giving users a more reliable installation experience. It installs the certificates which identify MIT users to various protected sites.","A Computer Algebra System","Bot Framework Composer is an integrated development tool for developers and multi-disciplinary teams to build bots and conversational experiences with the Microsoft Bot Framework. Within this tool, you'll find everything you need to build a sophisticated conversational experience.","Secure Git credential storage for Windows with support for Visual Studio Team Services, GitHub, and Bitbucket multi-factor authentication.","The Microsoft Visual C++ 2012 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2012 on a computer that does not have Visual C++ 2012 installed.","The Microsoft Visual C++ 2013 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2013 on a computer that does not have Visual C++ 2013 installed.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","MongoDB is a general purpose, document-based, distributed database built for modern application developers and for the cloud era.","Create, view and edit text documents, spreadsheets and presentations of any size and complexity. Work on documents of most popular formats: DOCX, ODT, XLSX, ODS, CSV, PPTX, ODP, etc. Deal with multiple files within one and the same window thanks to the tab-based user interface.","OpenVPN Connect is the official client software for OpenVPN on the Windows platform.","OpenVPN Connect is the official client software for OpenVPN on the Windows platform.","Pidgin is a chat program which lets you log in to accounts on multiple chat networks simultaneously. This means that you can be chatting with friends on MSN, talking to a friend on Google Talk, and sitting in a Yahoo chat room all at the same time.","Get instant access to a huge on demand game collection – the only place to play PlayStation exclusive titles on Windows PC.","The Collaboration Platform for API Development","Private Internet Access is an open source personal virtual private network service. It supports multiple VPN technologies such as PPTP, L2TP/IPsec, SOCKS5, WireGuard and OpenVPN.","Puppet is an open-core software configuration management tool","Qalculate! is a highly versatile and user-friendly cross-platform desktop calculator, with features such as a large library of customizable functions, unit calculations and conversion, physical constants, symbolic calculations (including integrals and equations), arbitrary precision, and uncertainty propagation.","The base binary distribution of R statistics language.","WinAMP (Windows Audio MPEG Player) is a program from Nullsoft that allows PC users to play audio files, particularly music, in many (but not all) popular digital audio formats, including MS-Audio, WAV, and MP3","RescueTime’s powerful time tracking and distraction blocking software gives you the tools and data you need to become your most productive self.","L'Math is an Electron powered text editor that is mainly used by Finnish students preparing for their digital matriculation exams. L'Math has the same LaTeX editor built-in that is found on the Digabi platform.","FFFTP is lightweight FTP client software. FFFTP has many useful feature such as directory mirroring, character encdoging conversion, Firewall and SOCK, one-time password support, and so on.","Scilab is free and open source software for numerical computation providing a powerful computing environment for engineering and scientific applications.","Open Source Desktop Publishing","The WPF Spy Utility","Search for icons and drag to any app. Works offline.","API Support for your favorite torrent trackers.","KDiff3 is a diff and merge program.","Utility for comparing and merging files and directories","Explore the neighborhood with Marble's rich set of city and street level maps. Search for addresses and places of interest. Marble takes care of querying various search backends and presents their results in a unified view. Calculate pedestrian, bike and motorcar routes with ease — online and offline, with an arbitrary number of via points.","KeePassXC is a community fork of KeePassX, a native cross-platform port of KeePass Password Safe, with the goal to extend and improve it with new features and bugfixes to provide a feature-rich, fully cross-platform and modern open-source password manager.","A Cross Platform and Open Source Electronics Design Automation Suite","The .NET Programmer’s Playground","AutoHotkey is a free, open-source scripting language for Windows that allows users to easily create small to complex scripts for all kinds of tasks such as: form fillers, auto-clicking, macros, etc.","'Those Funny Funguloids!' is a space-flying-mushroom-picking-simulator. You collect mushrooms, bring them back to your home base and profit!","The ultimate MSIX toolkit for IT Pros","DEV Version of the new Microsoft Edge Chromium. Updated weekly.","Create stunning reports and visualizations with Power BI Desktop. It puts visual analytics at your fingertips with intuitive report authoring. Drag-and-drop to place content exactly where you want it on the flexible and fluid canvas. Quickly discover patterns as you explore a single unified view of linked, interactive visualizations.","Microsoft R Open is the enhanced distribution of open source R from Microsoft Corporation. Enhancements include multi-core processing, a fixed CRAN repository date, and reproducible R with the checkpoint package. It includes Intel Math Kernel Library (Intel MKL) as well.","The Microsoft Visual C++ 2005 SP1 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 32-bit applications developed with Visual C++ 2005 SP1 on a computer that does not have Visual C++ 2005 SP1 installed.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","A fast, minimal browser that protects your privacy.","Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.","Firefox Developer Edition is the blazing fast browser that offers cutting edge developer tools and latest features like CSS Grid support and framework debugging","Firefox Developer Edition is the blazing fast browser that offers cutting edge developer tools and latest features like CSS Grid support and framework debugging","Get unmatched data protection on the release cadence that suits you with Firefox for enterprise.","Windows client for Mullvad VPN","Tux Paint is a free, award-winning drawing program for children ages 3 to 12 (for example, preschool and K-6). Tux Paint is used in schools around the world as a computer literacy drawing activity. It combines an easy-to-use interface, fun sound effects, and an encouraging cartoon mascot who guides children as they use the program.","GeForce NOW instantly transforms nearly any laptop, desktop, Mac, SHIELD TV or Android mobile device into the PC gaming rig you've always dreamed of. Instantly play the most demanding PC games and seamlessly play across your devices.","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","The Advanced REST Client desktop application.","A beautiful Plex music player for audiophiles, curators, and hipsters.","The Collaboration Platform for API Development","Python is a programming language that lets you work more quickly and integrate your systems more effectively.","Python is a programming language that lets you work more quickly and integrate your systems more effectively.","Retroshare establishes encrypted connections between you and your friends to create a network of computers, and provides various distributed services on top of it: forums, channels, chat, mail... Retroshare is fully decentralized, and designed to provide maximum security and anonymity to its users beyond direct friends. Retroshare is entirely free and open-source software. It is available on Android, Linux, MacOS and Windows. There are no hidden costs, no ads and no terms of service.","this is the rust-lang built with gnu toolchain","Steel Bank Common Lisp (SBCL) is a high performance Common Lisp compiler.","Linrad is a free advanced SDR program with a steeper learning curve compared to most other SDR programs. Many users prefer to use Linrad as it can be set up to have a very high amount of information density on the screen and it also has an advantage with receiving signals with the E4000 tuner as it can be made it run in a special linearity mode which significantly improves the dynamic range.","Trezor Communication Daemon aka Trezor Bridge","GUI for installing apps through WinGet and Creating Yaml file","An IRC client based on XChat.","Calculate and display hash values from over two dozen popular hashing algorithms","Bring your PC to its limits with the freeware stress test tool HeavyLoad. HeavyLoad puts your workstation or server PC under a heavy load and lets you test whether they will still run reliably.","A browser for the LBRY network, a digital marketplace controlled by its users.","Extract LaTeX from PDFs or handwritten notes in seconds just by taking a screenshot.","Meld is a visual diff and merge tool targeted at developers.","Beta Version of the new Microsoft Edge Chromium. Updated every 6 weeks.","An open-source implementation of the Python programming language which is tightly integrated with the .NET Framework.","The Multilingual App Toolkit (MAT) 4.0 integrates with Microsoft Visual Studio 2019 to provide Windows apps with translation support, translation file management, and editor tools.","PowerShell is a cross-platform (Windows, Linux, and macOS) automation and configuration tool/framework that works well with your existing tools and is optimized for dealing with structured data (e.g. JSON, CSV, XML, etc.), REST APIs, and object models. It includes a command-line shell, an associated scripting language and a framework for processing cmdlets.","Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experience for greater productivity. Inspired by the Windows 95 era PowerToys project, this reboot provides power users with ways to squeeze more efficiency out of the Windows 10 shell and customize it for individual workflows.","Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experience for greater productivity. Inspired by the Windows 95 era PowerToys project, this reboot provides power users with ways to squeeze more efficiency out of the Windows 10 shell and customize it for individual workflows.","Emulator for Microsoft's new dual-screen android, surface duo",".NET Framework is a technology that supports building and running Windows apps and web services. .NET Framework is designed to fulfill the following objectives.","The GUI for MongoDB. Visually explore your data. Run ad hoc queries in seconds. Interact with your data with full CRUD functionality. View and optimize your query performance. Available on Linux, Mac, or Windows. Compass empowers you to make smarter decisions about indexing, document validation, and more.","Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.","Firefox Developer Edition is the blazing fast browser that offers cutting edge developer tools and latest features like CSS Grid support and framework debugging","Thunderbird is a free email application that’s easy to set up and customize!","NonVisual Desktop Access (NVDA) is a free and open source screen reader for the Microsoft Windows operating system. Providing feedback via synthetic speech and Braille, it enables blind or vision impaired people to access computers running Windows for no more cost than a sighted person. NVDA is developed by NV Access, with contributions from the community.","Nelson is an array programming language providing a powerful open computing environment for engineering and scientific applications using modern C/C++ libraries (Boost, Eigen, …) and others state of art numerical libraries.It has sophisticated data structures (including cell, struct, linear systems, …), an interpreter and a high level programming language. Nelson has been developped to be an open/modular system where an user can define these own data types and operations on these data types by using overload.","Use the desktop clients to keep your files synchronized between your Nextcloud server and your desktop.","Fast and light-weight Notepad-like text editor with syntax highlighting","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","OpenSCAD is a software for creating solid 3D CAD models. It is free software and available for Linux/UNIX, Windows and Mac OS X. Unlike most free software for creating 3D models (such as Blender) it does not focus on the artistic aspects of 3D modelling but instead on the CAD aspects. Thus it might be the application you are looking for when you are planning to create 3D models of machine parts but pretty sure is not what you are looking for when you are more interested in creating computer-animated movies.","An open source video game library manager and launcher with support for 3rd party libraries like Steam, GOG, Origin, Battle.net and Uplay. Includes game emulation support, providing one unified interface for your games.","Connect to Plex Media Server and play content for Windows Home Theater PCs","Open Source administration and development platform for PostgreSQL","Comprehensive Hardware Analysis, Monitoring and Reporting for Windows and DOS.","RStudio is a set of integrated tools designed to help you be more productive with R. It includes a console, syntax-highlighting editor that supports direct code execution, and a variety of robust tools for plotting, viewing history, debugging and managing your workspace.","RStudio is a set of integrated tools designed to help you be more productive with R. It includes a console, syntax-highlighting editor that supports direct code execution, and a variety of robust tools for plotting, viewing history, debugging and managing your workspace.","Revo Uninstaller helps you to uninstall software and remove unwanted programs easily.","League of Legends installer EUW","Ricochet is a different approach to instant messaging that doesn' t trust anyone in protecting your privacy.","Allows playing numerous adventures and RPGs on modern systems","Greenshot Setup","Free: Freeware binary files editing tool","a unified communication and collaboration platform that combines persistent workplace chat and video meetings","Use ImageMagick® to create, edit, compose, or convert bitmap images.","Insomnia","API Support for your favorite torrent trackers.","SUMo (Software Update Monitor) keeps your PC up-to-date & safe by using the most recent version of your favorite software !","Krita is a professional FREE and open source painting program. It is made by artists that want to see affordable art tools for everyone.","LibreCAD is a cross-platform 2D CAD program written in C++11 using the Qt framework. It can read DXF and DWG files and can write DXF, PDF and SVG files. The user interface is highly customizable, and has dozens of translations.","A simple and elegant open-source markdown editor that focused on speed and usability.","Easy automated synchronisation between your computer and your MEGA cloud.","Convenient unified display of the most relevent technical and tag data for video and audio files.","Easy automated synchronisation between your computer and your MEGA cloud.","Free tool to easily manage your Azure cloud storage resources anywhere, from Windows, macOS, or Linux.","Development tool for the Microsoft Bot Framework. Allows developers to test and debug bots on localhost.","Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experience for greater productivity. Inspired by the Windows 95 era PowerToys project, this reboot provides power users with ways to squeeze more efficiency out of the Windows 10 shell and customize it for individual workflows.","PowerShell is a cross-platform (Windows, Linux, and macOS) automation and configuration tool/framework that works well with your existing tools and is optimized for dealing with structured data (e.g. JSON, CSV, XML, etc.), REST APIs, and object models. It includes a command-line shell, an associated scripting language and a framework for processing cmdlets.","PowerShell is a cross-platform (Windows, Linux, and macOS) automation and configuration tool/framework that works well with your existing tools and is optimized for dealing with structured data (e.g. JSON, CSV, XML, etc.), REST APIs, and object models. It includes a command-line shell, an associated scripting language and a framework for processing cmdlets.","Communication tool for free calls and chat.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","The Windows 10 SDK (10.0.17763.0) for Windows 10, version 1809 provides the latest headers, libraries, metadata, and tools for building Windows 10 apps.","The new Windows Terminal and the original Windows console host, all in the same place!",".NET Core is an open-source, general-purpose development platform. You can create .NET Core apps for Windows, macOS, and Linux for x64, x86, ARM32, and ARM64 processors using multiple programming languages. Frameworks and APIs are provided for cloud, IoT, client UI, and machine learning.","NordVPN encrypts your internet traffic and hides your IP and physical location. Works on 6 devices at once, on every major platform.","A free source code editor and Notepad replacement that supports several languages.","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","The MySQL software delivers a very fast, multithreaded, multi-user, and robust SQL (Structured Query Language) database server. MySQL Server is intended for mission-critical, heavy-load production systems as well as for embedding into mass-deployed software.","VirtualBox is a powerful x86 and AMD64/Intel64 virtualization product for enterprise as well as home use. Not only is VirtualBox an extremely feature rich, high performance product for enterprise customers, it is also the only professional solution that is freely available as Open Source Software under the terms of the GNU General Public License (GPL) version 2.","GetDiz is an ultrafast text editor with unique features.","Cacher is the code snippet organizer that empowers professional developers and their teams to get more coding done, faster.","Helix Visual Merge Tool (P4Merge) is a three-way merging and side-by-side file comparison tool. Use it to visualize your merges, obtain comprehensive file history, and compare a broad range of image files.","Host media content in Plex Media Server.","Open Source administration and development platform for PostgreSQL","The Collaboration Platform for API Development","Open Source administration and development platform for PostgreSQL","Python is a programming language that lets you work more quickly and integrate your systems more effectively.","WinRAR is a powerful archive manager. It can backup your data and reduce the size of email attachments, open and unpack RAR, ZIP and other files downloaded from Internet, create new archives in RAR and ZIP file format.","this is the rust-lang built with msvc","Lossless JPEG compression for photographers and webmasters.","The WPF Spy Utility","A first class OpenVPN client that lets you secure your network with ease & style.","Spotify music player","Spotify is a digital music service that gives you access to millions of songs.","Graphviz is open source graph visualization software. Graph visualization is a way of representing structural information as diagrams of abstract graphs and networks.","Loop Email helps teams connect, collaborate and communicate all in one place.","Intel XTU is a Windows*-based performance-tuning software that enables novice and experienced enthusiasts to overclock, monitor, and stress a system. The software interface exposes a set of robust capabilities common in most enthusiast platforms along with new features available on new Intel® Application Processors and Intel® Motherboards.","Free cross-platform password manager compatible with KeePass.","LINE reshapes communication around the globe, allowing you to enjoy not only messaging but also free voice and video calls wherever you find yourself. Download LINE and discover the reasons for its global popularity and number one ranking in 52 countries.","Lens is the only IDE you’ll ever need to take control of your Kubernetes clusters. It is a standalone application for MacOS, Windows and Linux operating systems. It is open source and free.","I Have No Tomatoes is an extreme leisure time activity idea of which culminates in the following question: How many tomatoes can you smash in ten short minutes? If you have the time to spare, this game has the vegetables just waiting to be eliminated!","Community developed fork of MySQL server.","Convenient unified display of the most relevent technical and tag data for video and audio files from command line.","Shotcut is a free, open source, cross-platform video editor.","Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experience for greater productivity. Inspired by the Windows 95 era PowerToys project, this reboot provides power users with ways to squeeze more efficiency out of the Windows 10 shell and customize it for individual workflows.","PowerShell is a cross-platform (Windows, Linux, and macOS) automation and configuration tool/framework that works well with your existing tools and is optimized for dealing with structured data (e.g. JSON, CSV, XML, etc.), REST APIs, and object models. It includes a command-line shell, an associated scripting language and a framework for processing cmdlets.","The Microsoft Visual C++ 2013 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2013 on a computer that does not have Visual C++ 2013 installed.","The Microsoft Visual C++ 2015 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2015 on a computer that does not have Visual C++ 2015 installed.","Windows Terminal Release Candidate v0.11.1251.0 (1.0rc1)","Molotov TV, or simply Molotov, is a French service of distribution of television channels over the Internet.","The mongo shell is an interactive JavaScript interface to MongoDB. You can use the mongo shell to query and update data as well as perform administrative operations.","Mp3tag is a powerful and easy-to-use tool to edit metadata of audio files.","Packet Sender is a free utility to allow sending and receiving TCP, UDP, and SSL (encrypted TCP) packets on the ports of your choosing.","Screen, webcam and sketchboard recorder with an integrated editor.","A free source code editor and Notepad replacement that supports several languages.","A free source code editor and Notepad replacement that supports several languages.","OpenMPT is a popular tracker software for Windows. OpenMPT (short hand for Open ModPlug Tracker) is completely free and allows you to create and play back some great music on your computer.","Transmission Remote GUI is a feature rich cross platform front-end to remotely control Transmission daemon via its RPC protocol. It is faster and has more functionality than the built-in Transmission web interface.","PostgreSQL is a powerful, open source object-relational database system with over 30 years of active development that has earned it a strong reputation for reliability, feature robustness, and performance.","QuiteRSS is a open-source cross-platform RSS/Atom news feeds reader.","Semi-realistic first-person shooter based on the Cube engine","this is the rust-lang built with gnu toolchain","ShareX is a free and open-source screen capture and file sharing software.","CCEnhancer is a small tool which adds support for over 1,000 new programs into the popular program CCleaner. The tool uses the winapp2.ini system built into CCleaner to easily add new rules and definitions for programs.","IZArc is the easiest way to Zip, Unzip and encrypt files for free","IceChat is a fully featured, simple to use IRC Client allowing you to chat online with your friends and for meeting new people as well.","The Intel® Driver & Support Assistant enables you to scan computing devices for the latest drivers available from Intel.","Every hard disk is too small if you just wait long enough. TreeSize Free tells you where precious disk space has gone.","Lazarus is a Delphi compatible cross-platform IDE for Rapid Application Development. It has variety of components ready for use and a graphical form designer to easily create complex graphical user interfaces.","LibreOffice is a free and powerful office suite, and a successor to OpenOffice.org (commonly known as OpenOffice). Its clean interface and feature-rich tools help you unleash your creativity and enhance your productivity.","MKVToolNix is a set of tools to create, alter, and inspect Matroska (.mkv) files","Save your files and photos to OneDrive and access them from any device, anywhere.","Microsoft OneDrive, or simply OneDrive, is a file hosting service and synchronization service operated by Microsoft as part of its web version of Office.","Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experience for greater productivity. Inspired by the Windows 95 era PowerToys project, this reboot provides power users with ways to squeeze more efficiency out of the Windows 10 shell and customize it for individual workflows.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Get unmatched data protection on the release cadence that suits you with Firefox for enterprise.","NSIS (Nullsoft Scriptable Install System) is a professional open source system to create Windows installers. It is designed to be as small and flexible as possible and is therefore very suitable for internet distribution.","Automate API and Application Performance Testing","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","PicoTorrent is designed to be a friendly BitTorrent client for Windows with high performance and low memory usage.","Get instant access to a huge on demand game collection – the only place to play PlayStation exclusive titles on Windows PC.","Host media content in Plex Media Server.","Easy to learn, funny to play! With PokerTH you can play the popular texas holdem poker game. Try your skills against the computer opponents, and find many friends to play with in the online games.","Bring macOS “Quick Look” feature to Windows","Qalculate! is a highly versatile and user-friendly cross-platform desktop calculator, with features such as a large library of customizable functions, unit calculations and conversion, physical constants, symbolic calculations (including integrals and equations), arbitrary precision, and uncertainty propagation.","A 5v5 character-based tactical shooter","A utility that helps format and create bootable USB flash drives.","RuneLite is a free, open source OldSchool RuneScape client.","Mathematics software system","Slack brings the team together, wherever you are.","The WPF Spy Utility","Control all your speakers, group rooms to play in sync, and quickly search for music and more.","A free, open-source, and completely encrypted notes app.","Stellarium is a free open source planetarium for your computer. It shows a realistic sky in 3D, just like what you see with the naked eye, binoculars or a telescope.","Stride is an open-source MIT C# game engine designed for the future of gaming.","The OHRRPGCE is a free and open-source, cross-platform (Windows, Mac, GNU/Linux, Android), and easy-to-use utility with which you can create your own 2D RPG game in a style similar to the classic Final Fantasy games on the NES, SNES and GBA which have so shaped the RPG genre. No programming is required to create a game, though there is a scripting language for customising the engine which has been used to create many non-RPG games.","HelpNDoc is a help authoring tool which can produce HTML web-sites, CHM help files, PDF and Word documents, iPhone web-sites, ePub and Kindle eBooks as well as QtHelp files from a single source.","Cyberduck is a libre server and cloud storage browser for Mac and Windows with support for FTP, SFTP, WebDAV, Amazon S3, OpenStack Swift, Backblaze B2, Microsoft Azure & OneDrive, Google Drive and Dropbox.","Cyberduck is a libre server and cloud storage browser for Mac and Windows with support for FTP, SFTP, WebDAV, Amazon S3, OpenStack Swift, Backblaze B2, Microsoft Azure & OneDrive, Google Drive and Dropbox.","UltraSearch searches files and folders on local NTFS drives and provides the results within just a few seconds.","Transmission remote GUI for Windows","The .NET Programmer’s Playground","System Update downloads software, driver and BIOS updates from a Lenovo server directly over the Internet without requiring specific user knowledge of where the package is located or if it is needed by the target system.","FreeCommander is an easy-to-use alternative to the standard windows file manager. The program helps you with daily work in Windows.","A powerful TweetDeck client for those who get real work done.","SQL Server Management Studio (SSMS) is an integrated environment for managing any SQL infrastructure, from SQL Server to Azure SQL Database. SSMS provides tools to configure, monitor, and administer instances of SQL Server and databases. Use SSMS to deploy, monitor, and upgrade the data-tier components used by your applications, and build queries and scripts.","The Microsoft Visual C++ 2013 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 32-bit applications developed with Visual C++ 2013 on a computer that does not have Visual C++ 2013 installed.","Visual Studio Build Tools","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.",".NET Core is an open-source, general-purpose development platform. You can create .NET Core apps for Windows, macOS, and Linux for x64, x86, ARM32, and ARM64 processors using multiple programming languages. Frameworks and APIs are provided for cloud, IoT, client UI, and machine learning.","The GUI for MongoDB. Visually explore your data. Run ad hoc queries in seconds. Interact with your data with full CRUD functionality. View and optimize your query performance. Available on Linux, Mac, or Windows. Compass empowers you to make smarter decisions about indexing, document validation, and more.","Mozilla Firefox czech","Firefox Developer Edition is the blazing fast browser that offers cutting edge developer tools and latest features like CSS Grid support and framework debugging","Thunderbird is a free email application that’s easy to set up and customize!","Thunderbird is a free email application that’s easy to set up and customize!","Manage performance, temperatures, and devices all from a single application. NZXT CAM is fast, efficient, and easy-to-use, allowing you to control every aspect of your computer.","Screen, webcam and sketchboard recorder with an integrated editor.","Play backgammon and other variants against award winning AI","A free source code editor and Notepad replacement that supports several languages.","A modern, lightweight text editor with a minimalist design.","Share your files anytime, anywhere, with any device","Open Source Geographic Information System (GIS)","Classic style Start Menu for Windows 7, 8, 8.1, 10","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","OpenTTD is an open source simulation game based upon the popular Microprose game \"Transport Tycoon Deluxe\", written by Chris Sawyer. It attempts to mimic the original game as closely as possible while extending it with new features.","The MySQL software delivers a very fast, multithreaded, multi-user, and robust SQL (Structured Query Language) database server. MySQL Server is intended for mission-critical, heavy-load production systems as well as for embedding into mass-deployed software.","Connect to Plex Media Server and play content for Windows Home Theater PCs","The Collaboration Platform for API Development","High-speed Swiss VPN that safeguards your privacy.","A free implementation of SSH and Telnet, along with an xterm terminal emulator.","Quick Pad is a modern notepad app featuring fluent design","WinRAR is a powerful archive manager. It can backup your data and reduce the size of email attachments, open and unpack RAR, ZIP and other files downloaded from Internet, create new archives in RAR and ZIP file format.","A full-featured cross-platform GUI for V2ray","A powerful cross-platform raw photo processing program.","Front end launcher for the WiiU emulator, Cemu","Virtual network computing (VNC) is a type of remote-control software that makes it possible to control another computer over a network connection.","Revo Uninstaller helps you to uninstall software and remove unwanted programs easily.","Free Media Player with built-in codecs.","Spotify is a digital music service that gives you access to millions of songs.","Generate Release Notes in MarkDown format from a GitHub project.","This package contains the HP Cloud Recovery Tool that supports Windows operation system. HP Cloud Recovery Tool allow users to download HP Recovery Media into a USB flash drive to recover their own HP personal system.","The IDA Disassembler and Debugger is an interactive, programmable, extensible, multi-processor disassembler","Inno Setup is a free installer for Windows programs by Jordan Russell and Martijn Laan. First introduced in 1997, Inno Setup today rivals and even surpasses many commercial installers in feature set and stability.","Julia is a high-level, high-performance, dynamic programming language","End-to-end encryption for things that matter. Keybase is secure messaging and file-sharing.","Laragon - fast & powerful local development environment","Loom combines the expressiveness of video with the convenience of messaging, it’s a new, more effective way of communicating with co-workers and customers.","MyMoney is a rich client .NET application for managing your personal finances. It is written entirely in C# and is designed for programmers who want easy access to their data and who want to quickly and easily add their own features. Your data will not be locked up in some proprietary format, it is yours to do with as you like.","The ultimate MSIX toolkit for IT Pros","Mattermost Desktop application for Windows","The Azure command-line interface (Azure CLI) is a set of commands used to create and manage Azure resources. The Azure CLI is available across Azure services and is designed to get you working quickly with Azure, with an emphasis on automation.","The Microsoft Visual C++ 2015-2019 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2015, 2017 and 2019 on a computer that does not have Visual C++ 2015, 2017 and 2019 installed.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","Windows Terminal Release Candidate v0.11.1333.0 (1.0rc2)","Sponsored by Microsoft, Mono is an open source implementation of Microsoft's .NET Framework based on the ECMA standards for C# and the Common Language Runtime. A growing family of solutions and an active and enthusiastic contributing community is helping position Mono to become the leading choice for development of cross platform applications.","Play games remotely from your NVIDIA GameStream-enabled PC","The best browser with fast site rendering, advanced privacy, a sleek design and innovative features.","Mu is a Python code editor for beginner programmers","Minimal outline notes","Manage performance, temperatures, and devices all from a single application. NZXT CAM is fast, efficient, and easy-to-use, allowing you to control every aspect of your computer.","OpenVPN Connect is the official client software for OpenVPN on the Windows platform.","The MySQL software delivers a very fast, multithreaded, multi-user, and robust SQL (Structured Query Language) database server. MySQL Server is intended for mission-critical, heavy-load production systems as well as for embedding into mass-deployed software.","Restore accidentally deleted files quickly and easily","A free implementation of SSH and Telnet, along with an xterm terminal emulator.","Red Eclipse is a fun-filled new take on the first person arena shooter, featuring parkour, impulse boosts, and more.","Use Raspberry Pi Imager for an easy way to install Raspbian and other operating systems to an SD card ready to use with your Raspberry Pi.","Using RDP, VNC, SSH based terminals, S/FTP or web-based interfaces","this is the rust-lang built with msvc","Easy typing of special characters on Windows","Start10 software, replaces the Start menu with a classic version. This Windows 7-style look is a comfortable return to the form and function you expect.","Stellarium is a free open source planetarium for your computer. It shows a realistic sky in 3D, just like what you see with the naked eye, binoculars or a telescope.","Stretchly is a cross-platform electron app that reminds you to take breaks when working on your computer.","Intercept & view all your HTTP(S) request","Intel XTU is a Windows*-based performance-tuning software that enables novice and experienced enthusiasts to overclock, monitor, and stress a system. The software interface exposes a set of robust capabilities common in most enthusiast platforms along with new features available on new Intel® Application Processors and Intel® Motherboards.","A self-contained simulator that runs MIPS32 programs","Installer for the KiCad EDA Suite","LibreOffice is a free and powerful office suite, and a successor to OpenOffice.org (commonly known as OpenOffice). Its clean interface and feature-rich tools help you unleash your creativity and enhance your productivity.","Visualizer for neural network, deep learning and machine learning models","The ultimate MSIX toolkit for IT Pros","Memurai is a Redis-5-compatible cache and data store for Windows. \nIt is designed to provide the reliability and performance demanded by enterprise Windows environments.\nJust like Redis, Memurai uses an in-memory data set to achieve great performance at scale, \nand Memurai supports all the Redis features that you know and love, such as persistence, \nreplication, transactions, LUA scripting, high-availability, pub/sub, cluster, modules, streams, and LRU eviction. \nIn fact, it supports all of the Redis API 5 eviction policies.\n","Azure Data Studio is a data management tool that enables you to work with SQL Server, Azure SQL DB and SQL DW from Windows, macOS and Linux.","Microsoft OneDrive, or simply OneDrive, is a file hosting service and synchronization service operated by Microsoft as part of its web version of Office.","Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experience for greater productivity. Inspired by the Windows 95 era PowerToys project, this reboot provides power users with ways to squeeze more efficiency out of the Windows 10 shell and customize it for individual workflows.","The SharePoint Online Management Shell is a tool that contains a Windows PowerShell Module to manage your SharePoint Online subscription in the Office 365.","The Microsoft Visual C++ 2010 SP1 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2010 SP1 on a computer that does not have Visual C++ 2010 SP1 installed.","The Microsoft Visual C++ 2013 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 32-bit applications developed with Visual C++ 2013 on a computer that does not have Visual C++ 2013 installed.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","The Windows 10 SDK (10.0.18362.0) for Windows 10, version 1903 provides the latest headers, libraries, metadata, and tools for building Windows 10 apps.","Windows Terminal is a modern terminal application for users of command line tools and shells like Command Prompt, PowerShell, and Windows Subsystem for Linux (WSL). Its main features include multiple tabs, panes, Unicode and UTF-8 character support, a GPU accelerated text rendering engine, and the ability to create your own themes and customize text, colors, backgrounds, and shortcut key bindings.",".NET Framework is a technology that supports building and running Windows apps and web services. .NET Framework is designed to fulfill the following objectives.","The GUI for MongoDB. Visually explore your data. Run ad hoc queries in seconds. Interact with your data with full CRUD functionality. View and optimize your query performance. Available on Linux, Mac, or Windows. Compass empowers you to make smarter decisions about indexing, document validation, and more.","One framework for creating powerful cross-platform games.","Get a sneak peek at our next generation web browser, and help us make it the best browser it can be: try Firefox Nightly.","Screen, webcam and sketchboard recorder with an integrated editor.","Artificial Intelligence Computing Leadership from NVIDIA","QGIS is a user friendly Open Source Geographic Information System (GIS) licensed under the GNU General Public License. QGIS is an official project of the Open Source Geospatial Foundation (OSGeo). It runs on Linux, Unix, Mac OSX, Windows and Android and supports numerous vector, raster, and database formats and functionalities.","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","Free video downloader for sites such as YouTube and TikTok.","Java Runtime Environment","The MySQL software delivers a very fast, multithreaded, multi-user, and robust SQL (Structured Query Language) database server. MySQL Server is intended for mission-critical, heavy-load production systems as well as for embedding into mass-deployed software.","An Experimental Peer-to-Peer Web Browser.","Host media content in Plex Media Server.","A full-featured cross-platform GUI for V2ray","Reddit Wallpaper Changer is a lightweight C# application for Windows that will scrape Reddit for fresh desktop wallpapers. You can specify which subs to scrape from and how oftern to rotate your wallpaper.","The OpenAPI/Swagger API toolchain for .NET and TypeScript","DB Browser for SQLite (DB4S) is a high quality, visual, open source tool to create, design, and edit database files compatible with SQLite.","Zulu UC is desktop and mobile integration for businesses using PBXact and FreePBX phone systems, delivering productivity and collaboration tools through a single application which can be installed on most desktop and laptop computers as well as on iOS and Android mobile devices.","Enpass is a cross-platform password management app to securely store passwords and other credentials in a virtual vault locked with a master password. Unlike most other popular password managers, Enpass is an offline password manager","The Ultimate data recovery software! Supporting ALL types of media, including CD/DVD, BD/HD DVD, Hard Drives, SSM, USB flash drives, Zip drives, Jaz drives, floppies etc.","Free Download Manager (FDM for short) is a free, efficient, and comprehensive solution for managing all your downloads.","Powerful multipurpose network administration tool for Windows and macOS.","Sonic Pi is a code-based music creation and performance tool.","A Windows installer for the Hack typeface.","A lightweight client for managing MariaDB, MySQL, SQL Server, PostgreSQL and SQLite, written in Delphi","Epic is a private, secure web browser that blocks ads, trackers, fingerprinting, cryptomining, ultrasound signaling and more. Stop 600+ tracking attempts in an average browsing session. Turn on network privacy with our free VPN (servers in 8 countries).","Lunacy is a native Windows app that opens, edits, and stores .sketch files. And it’s completely free.","Nmap (\"Network Mapper\") is a free and open source utility for network discovery and security auditing.","An open source, decentralized package manager, to automate building and sharing of packages","Color Cop is a multi-purpose color picker for web designers and programmers.","Julia is a high-level, high-performance, dynamic programming language","A pandoc filter to generate figures from source code","A multi-platform desktop app for finding media.","FontBase is the font manager of the new generation, built by designers, for designers.","RetroArch is a frontend for emulators, game engines and media players.","LyX is a document processor that encourages an approach to writing based on the structure of your documents (WYSIWYM) and not simply their appearance (WYSIWYG). LyX combines the power and flexibility of TeX/LaTeX with the ease of use of a graphical interface.","Media Player Classic - Home Cinema (MPC-HC) is a free and open-source (OSS) video and audio player for Windows.","The ultimate MSIX toolkit for IT Pros","Memurai is a Redis-5-compatible cache and data store for Windows. \nIt is designed to provide the reliability and performance demanded by enterprise Windows environments.\nJust like Redis, Memurai uses an in-memory data set to achieve great performance at scale, \nand Memurai supports all the Redis features that you know and love, such as persistence, \nreplication, transactions, LUA scripting, high-availability, pub/sub, cluster, modules, streams, and LRU eviction. \nIn fact, it supports all of the Redis API 5 eviction policies.\n","Free tool to easily manage your Azure cloud storage resources anywhere, from Windows, macOS, or Linux.","The Microsoft DirectX® End-User Runtime installs a number of runtime libraries from the legacy DirectX SDK for some games that use D3DX9, D3DX10, D3DX11, XAudio 2.7, XInput 1.3, XACT, and/or Managed DirectX 1.1. Note that this package does not modify the DirectX Runtime installed on your Windows OS in any way.","World-class performance with more privacy, more productivity, and more value while you browse.","Beta Version of the new Microsoft Edge Chromium. Updated every 6 weeks.","World-class performance with more privacy, more productivity, and more value while you browse.","The MSIX SDK project is an effort to enable developers on a variety of platforms to pack and unpack packages for the purposes of distribution from either the Microsoft Store, or their own content distribution networks.","The Microsoft Visual C++ 2015 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 32-bit applications developed with Visual C++ 2015 on a computer that does not have Visual C++ 2015 installed.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","The Windows 10 SDK (10.0.19041.0) for Windows 10, version 2004 provides the latest headers, libraries, metadata, and tools for building Windows 10 apps.","Powerful notes app for individuals and teams. Fast, focused, always in sync. Notejoy is available on Mac, PC, iOS, Android, and the web. Sign up free.","Thunderbird is a free email application that’s easy to set up and customize!","Low-latency and high quality voice chat primarily intended for use while gaming.","Transform information chaos from multiple sources into an organized workplace.","BlueScreenView scans all your minidump files created during 'blue screen of death' crashes, and displays the information about all crashes in one table. For each crash, BlueScreenView displays the minidump filename, the date/time of the crash, the basic crash information displayed in the blue screen (Bug Check Code and 4 parameters), and the details of the driver or module that possibly caused the crash (filename, product name, file description, and file version).","A simple & beautiful tool for pictures uploading built by vue-cli-electron-builder","CCleaner Installer","A beautiful Plex music player for audiophiles, curators, and hipsters.","High-speed Swiss VPN that safeguards your privacy.","Python is a programming language that lets you work more quickly and integrate your systems more effectively.","Lightweight text and code editor using KF5's syntax highlighting repository","RStudio is a set of integrated tools designed to help you be more productive with R. It includes a console, syntax-highlighting editor that supports direct code execution, and a variety of robust tools for plotting, viewing history, debugging and managing your workspace.","SharpKeys is a Registry hack that is used to make certain keys on a keyboard act like other keys.","A modified browser built using Electron that helps in responsive web development.","Ruby Programming Language for Windows","Extension module for Windows Explorer to render SVG thumbnails, so that you can have an overview of your SVG files.","We help with your PDF tasks, Easy, pleasant and productive PDF editor","Stride is an open-source MIT C# game engine designed for the future of gaming.","An innovative, convenient and secure cross-platform crypto app","Hedgewars is a turn-based strategy, artillery, action and comedy game, featuring the antics of pink hedgehogs with attitude as they battle from the depths of hell to the depths of space.","A one-stop development tool for huawei quick app built on the Visual Studio Code framework.","Save your files and photos to Jianguoyun and access them from any device, anywhere.","Enabling communication between all your devices. Made for people like you.","A browser for the LBRY network, a digital marketplace controlled by its users.","A browser for the LBRY network, a digital marketplace controlled by its users.","LibreOffice The Document Foundation","Customize Logitech G gaming mice, keyboards, headsets, speakers, and other devices","Bot Framework Composer is an integrated development tool for developers and multi-disciplinary teams to build bots and conversational experiences with the Microsoft Bot Framework. Within this tool, you'll find everything you need to build a sophisticated conversational experience.","World-class performance with more privacy, more productivity, and more value while you browse.","World-class performance with more privacy, more productivity, and more value while you browse.","The Microsoft Mouse and Keyboard Center is an application that helps you make the most out of your Microsoft keyboard and mouse. Mouse and Keyboard Center helps you personalize and customize how you work on your PC.","Microsoft OneDrive, or simply OneDrive, is a file hosting service and synchronization service operated by Microsoft as part of its web version of Office.","The Microsoft Visual C++ 2010 SP1 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2010 SP1 on a computer that does not have Visual C++ 2010 SP1 installed.","The Microsoft Visual C++ 2015-2019 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2015, 2017 and 2019 on a computer that does not have Visual C++ 2015, 2017 and 2019 installed.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","The Dude network monitor is a new application by MikroTik which can dramatically improve the way you manage your network environment.","Handles all the steps of installing mods for Satisfactory, including download of SML and Bootstrapper.","The GUI for MongoDB. Visually explore your data. Run ad hoc queries in seconds. Interact with your data with full CRUD functionality. View and optimize your query performance. Available on Linux, Mac, or Windows. Compass empowers you to make smarter decisions about indexing, document validation, and more.","Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.","Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.","Thunderbird is a free email application that’s easy to set up and customize!","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","OpenRA is a project that recreates and modernizes the classic Command & Conquer real time strategy games. We have developed a flexible open source game engine (the OpenRA engine) that provides a common platform for rebuilding and reimagining classic 2D and 2.5D RTS games (the OpenRA mods).","Opera browser for computers","Free PDF Tools.","VPN client","SSHFS for Windows","Messaging app for WhatsApp, Slack, Telegram, HipChat, Hangouts and many many more.","HM NIS Edit is the best Editor/IDE for Nullsoft Scriptable Install System (NSIS). Its useful for experts and beginners in the creation of Setup programs with the NSIS. Its Script Wizard will help you to create standard Setup programs with only few clicks, also its InstallOptions designer will help you to create your own custom pages with a friendly drag and drop interface.","Pingus is a free Lemmingstm-like puzzle game covered under the GNU GPL. It features currently 77 playable levels and runs under a wide variety of operating systems (Linux, Windows, MacOSX, etc.)","IrfanView ... one of the most popular viewers worldwide.","Cyberduck is a libre server and cloud storage browser for Mac and Windows with support for FTP, SFTP, WebDAV, Amazon S3, OpenStack Swift, Backblaze B2, Microsoft Azure & OneDrive, Google Drive and Dropbox.","As multifunctional as a Swiss Army knife is the market-leading file and disk space manager TreeSize. Use this 30-day free trial version to convince yourself of the advanced features and possibilities.","A fast open source text search tool, optimized for software development","drawio-desktop is a diagrams.net desktop app based on Electron. draw.io is the old name for diagrams.net, we just don't want the hassle of changing all the binary's names.","Manage your tools the easy way.","Kate is a multi-document editor part of KDE since release 2.2. Being a KDE applications, Kate ships with network transparency, as well as integration with the outstanding features of KDE.","KeePassXC is a free and open-source password manager. It started as a community fork of KeePassX.","A Cross Platform and Open Source Electronics Design Automation Suite","A browser for the LBRY network, a digital marketplace controlled by its users.","Seamlessly move files and settings from your old PC to your new one.","The ultimate MSIX toolkit for IT Pros","Master Packager is an application packaging tool to create and edit Microsoft Windows Installer (MSI) files and repackage other installation to MSI format.","Mattermost Desktop application for Windows","Development tool for the Microsoft Bot Framework. Allows developers to test and debug bots on localhost.","World-class performance with more privacy, more productivity, and more value while you browse.","World-class performance with more privacy, more productivity, and more value while you browse.","PowerShell is a cross-platform (Windows, Linux, and macOS) automation and configuration tool/framework that works well with your existing tools and is optimized for dealing with structured data (e.g. JSON, CSV, XML, etc.), REST APIs, and object models. It includes a command-line shell, an associated scripting language and a framework for processing cmdlets.","The Microsoft Visual C++ 2005 SP1 Redistributable Package (x64) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2005 SP1 on a computer that does not have Visual C++ 2005 SP1 installed.","The Microsoft Visual C++ 2010 SP1 Redistributable Package (x86) installs runtime components of Visual C++ Libraries required to run 64-bit applications developed with Visual C++ 2010 SP1 on a computer that does not have Visual C++ 2010 SP1 installed.","Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications. Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.","This is an offline installer. There are separate installers for web and offline installation. If you intend to redistribute either of these installers in the setup for your own product or application, we recommend that you choose the web installer because it is smaller and typically downloads faster. You can download the web installer here. Wherever possible, Microsoft recommends you use the Web Installer in lieu of the Offline Package for optimal efficiency and bandwidth requirements. The offline package can be used in situations where the web installer cannot be used due to lack of internet connectivity. This package is larger than the web installer and does not include the language packs. You can download and install the language packs from here.","Thunderbird is a free email application that’s easy to set up and customize!","A cross-platform music tagger written in Python.","MY.GAMES Store Launcher","A desktop app for downloading Beat Saber songs.","Free and open source software for video recording and live streaming.","Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine.","Free video downloader for sites such as YouTube and TikTok.","Persepolis is a Download Manager & a GUI For aria2.","CCleaner Installer","A beautiful Plex music player for audiophiles, curators, and hipsters.","QMPlay2 is a video and audio player. It can play all formats supported by FFmpeg, libmodplug (including J2B and SFX). It also supports Audio CD, raw files, Rayman 2 music and chiptunes. It contains YouTube and Prostopleer browser.","Rambox is a workspace browser that allows you to manage as many applications as you want, all in one place. It is perfect for people who care about productivity and work with many applications, both business and personal.","Virt Viewer provides a graphical viewer for the guest OS. Supports guest OS VNC/SPICE","Renode is an open source software development framework with commercial support from Antmicro that lets you develop, debug and test multi-node device systems reliably, scalably and effectively.","Ruby Programming Language for Windows","this is the rust-lang built with gnu toolchain","this is the rust-lang built with gnu toolchain","this is the rust-lang built with msvc","Control your legacy S1 speakers, group rooms to play in sync, and quickly search for music and more.","Control all your speakers, group rooms to play in sync, and quickly search for music and more.","Streamlink is a CLI utility which pipes video streams from various services into a video player, such as VLC.","The Free File Renaming Utility for Windows.","Lidarr Setup","Telegram is a cloud-based mobile and desktop messaging app with a focus on security and speed.","TeXworks is an environment for authoring TeX (LaTeX, ConTeXt, etc) documents, with a Unicode-based, TeX-aware editor, integrated PDF viewer, and a clean, simple interface accessible to casual and non-technical users.","Free, easy to use and flexible level editor.","If you’re simply looking to track time, any stopwatch will do. Toggl goes beyond time tracking.","Connect all your devices using WireGuard, without the hassle.","GPU-Z is a lightweight system utility designed to provide vital information about your video card and graphics processor.","Fiddler is a free web debugging tool which logs all HTTP(S) traffic between your computer and the Internet. Inspect traffic, set breakpoints, and fiddle with incoming or outgoing data.","The open source video transcoder","Sumatra PDF is a PDF, ePub, MOBI, CHM, XPS, DjVu, CBZ, CBR reader for Windows","TeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS. TeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.","Connecting a billion people with calls, chats and more.","A mininal but complete colorpicker desktop app.","System Information for Windows - Everything you want to know about your computer","TortoiseHg is a Windows shell extension and a series of applications for the Mercurial distributed revision control system.","Simply put, Dimension 4 is the fastest and easiest way to synchronize your computer's clock if you're running a Windows-based operating system. Once Dimension 4 is installed, you'll most likely forget that it's even running. It's that automatic.","TikzEdt is a combined WYSIWYG/text editor designed for editing Tikz code.","Fast and reliable cross-platform FTP, FTPS and SFTP client with lots of useful features and an intuitive graphical user interface.","Git GUI client from the makers of Sublime Text","Sublime is a sophisticated cross-platform text editor for code, markup and prose.","TeX Live is intended to be a straightforward way to get up and running with the TeX document production system.","Taisei (泰西, lit. Occident) is a free and open-source fangame of the Tōhō series, written in C using SDL2 and OpenGL.","Screen Capture and Recording Software","TorGuard VPN Service encrypts your internet access","Backed by Tencent's 21 years of experience in audiovisual communications, VooV Meeting provides one-stop cloud-based conferencing solutions. The high-definition and smooth audiovisual quality allows you to experience immersive conference collaboration anytime, anywhere.","Texmaker is a free, modern and cross-platform LaTeX editor for linux, macosx and windows systems that integrates many tools needed to develop documents with LaTeX, in just one application.","The free and open-source image viewer for Microsoft Windows","Telegram is a cloud-based mobile and desktop messaging app with a focus on security and speed.","基于腾讯20多年音视频通讯经验，腾讯会议提供一站式音视频会议解决方案，让您能随时随地体验高清流畅的会议以及会议协作。","open-source, free, software terminal emulator","If you’re simply looking to track time, any stopwatch will do. Toggl goes beyond time tracking.","System Information for Windows - Everything you want to know about your computer","TortoiseSVN is a really easy to use Revision control/version control/source control software for Windows. It is based on Apache™ Subversion (SVN)®; TortoiseSVN provides a nice and easy user interface for Subversion.","Internet Download Manager (IDM) is a tool to increase download speeds by up to 5 times, resume and schedule downloads.","wrap unlimited number of PuTTY applications in one tabbed GUI interface","Connect all your devices using WireGuard, without the hassle.","Easily take screen captures, transfer files, and write TI basic programs for the TI-84 Plus family.","Fast and reliable cross-platform FTP, FTPS and SFTP client with lots of useful features and an intuitive graphical user interface.","WinCDEmu is an open-source CD/DVD/BD emulator - a tool that allows you to mount optical disc images by simply clicking on them in Windows Explorer. If you have downloaded an ISO image and want to use it without burning it to a blank disc, WinCDEmu is the easiest way to do it.","TeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS. TeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.","Use crystal clear sound to communicate with your team mates cross-platform with military-grade security, lag-free performance & unparalleled reliability and uptime.","Screen Capture and Recording Software","Backed by Tencent's 21 years of experience in audiovisual communications, Tencent Meeting provides one-stop cloud-based conferencing solutions. The high-definition and smooth audiovisual quality allows you to experience immersive conference collaboration anytime, anywhere.","Secure, Modern, Fully-Featured Cross-Architecture & Cross-Platform DNS Server Using C# 8.0 & .NET Core 3.1","System Information for Windows - Everything you want to know about your computer","Professional text and hex editor with Binary Templates","Arcade 3D racer with a variety of characters, tracks and modes","Windows tray utility / filesystem watcher / launcher for syncthing","GPU-Z is a lightweight system utility designed to provide vital information about your video card and graphics processor.","Save your files and photos to Weiyun and access them from any device, anywhere.","Powerful computer software with a Computer Algebra System (CAS) that satisfies math and science curriculum needs from middle school through college.","System Information for Windows - Everything you want to know about your computer","Git GUI client from the makers of Sublime Text","Where Remote Teams Get Work Done","System Information for Windows - Everything you want to know about your computer","System Information for Windows - Everything you want to know about your computer","System Information for Windows - Everything you want to know about your computer","TeXstudio is a fully featured LaTeX editor. Our goal is to make writing LaTeX documents as easy and comfortable as possible.","TeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS. TeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.","焕新一代，依旧实力过人","腾讯视频上线于2011年4月，是在线视频平台，拥有流行内容和专业的媒体运营能力，是聚合热播影视、综艺娱乐、体育赛事、新闻资讯等为一体的综合视频内容平台.","Trusted by millions of users, Ultimaker Cura is the world’s most popular 3D printing software. Prepare prints with a few clicks, integrate with CAD software for an easier workflow, or dive into custom settings for in-depth control.","Voicemeeter Banana is an Advanced Audio Mixer Application endowed with Virtual Audio Device used as Virtual I/O to mix and manage any audio sources from or to any audio devices or applications.","Vivaldi, free web browser","Workrave is a free program that assists in the recovery and prevention of Repetitive Strain Injury (RSI). It monitors your keyboard and mouse usage and using this information, it frequently alerts you to take microbreaks, rest breaks and restricts you to your daily computer usage.","XnView is an efficient image viewer, browser and converter for Windows. This software is really simple to use and totally free for personal use. It supports more than 500 image formats!","Youdao Dictionary has typical acoustic translation, smart screen word identification, real-time synchronization with network up-to-date vocabulary, and other word look-up features.","Double Commander is a cross platform open source file manager with two panels side by side. It is inspired by Total Commander and features some new ideas.","mpv.net is a modern media player for Windows that works just like mpv.","VMware Workstation Pro allows you to run multiple operating systems at once on the same Windows PC.","A free and open source cross-platform multimedia player and framework that plays most multimedia files as well as DVDs, Audio CDs, VCDs, and various streaming protocols.","Simple. Secure. Reliable messaging. With WhatsApp, you'll get fast, simple, secure messaging and calling for free*, available on phones all over the world.","Wireshark is the world's foremost and widely-used network protocol analyzer. It lets you see what's happening on your network at a microscopic level and is the de facto (and often de jure) standard across many commercial and non-profit enterprises, government agencies, and educational institutions.","Zettlr is a supercharged markdown editor that combines many writing editor features and collect them in one application. It aims at speeding up your workflow and help you write without any interruptions.","A full-featured download manager","Open source chemical drawing program","calibre is a powerful and easy to use e-book manager.","The smallest, fastest, fully-conformant Kubernetes that tracks upstream releases and makes clustering trivial. MicroK8s is great for offline development, prototyping, and testing. Use it on a VM as a small, cheap, reliable k8s for CI/CD. The best Kubernetes for appliances. Develop IoT apps for k8s and deploy them to MicroK8s.","Fast email client with full Gmail, Hotmail and other services synchronization. Best replacement for MS Outlook or Thunderbird. Free version for Home users.","Software to warm up your computer display at night, to match your indoor lighting.","OpenHashTab is a shell extension for conveniently calculating and checking file hashes from file properties.","Wirelessly transfer & backup your photos & videos.","Windows File System Proxy - FUSE for Windows","Wireshark is the world's foremost and widely-used network protocol analyzer. It lets you see what's happening on your network at a microscopic level and is the de facto (and often de jure) standard across many commercial and non-profit enterprises, government agencies, and educational institutions.","a cloud based free app that helps you and your team manage notes and knowledge efficiently across all devices.","GnuPG is a complete and free implementation of the OpenPGP standard as defined by RFC4880 (also known as PGP). GnuPG allows you to encrypt and sign your data and communications; it features a versatile key management system, along with access modules for all kinds of public key directories. GnuPG, also known as GPG, is a command line tool with features for easy integration with other applications. A wealth of frontend applications and libraries are available. GnuPG also provides support for S/MIME and Secure Shell (ssh).","a cloud based free app that helps you and your team manage notes and knowledge efficiently across all devices.","LightBulb is an application that reduces eyestrain produced by staring at a computer screen when working late hours. As the day goes on, it continuously adjusts gamma, transitioning the display color temperature from cold blue in the afternoon to warm yellow during the night. Its primary objective is to match the color of the screen to the light sources of your surrounding environment - typically, sunlight during the day and artificial light during the night. LightBulb has minimal impact on performance and offers many customization options.","The Unity Hub is a management tool that you can use to manage all of your Unity Projects and installations. Use the Hub to manage multiple installations of the Unity Editor along with their associated components, create new Projects, and open existing Projects.","Virtual Eurorack DAW","Steam is a digital distribution platform developed by Valve Corporation for purchasing and playing video games. Steam offers digital rights management, matchmaking servers, video streaming, and social networking services.","Simple. Secure. Reliable messaging. With WhatsApp, you'll get fast, simple, secure messaging and calling for free*, available on phones all over the world.","WinMerge is an Open Source differencing and merging tool for Windows.","WinSCP is an open source free SFTP client, FTP client, WebDAV client, S3 client and SCP client for Windows. Its main function is file transfer between a local and a remote computer. Beyond this, WinSCP offers scripting and basic file manager functionality.","HTTrack allows you to download a World Wide Web site from the Internet to a local directory, building recursively all directories, getting HTML, images, and other files from the server to your computer. HTTrack arranges the original site's relative link-structure. Simply open a page of the \"mirrored\" website in your browser, and you can browse the site from link to link, as if you were viewing it online.","Video and audio conferencing software with chat and other features","A full-featured download manager","calibre is a powerful and easy to use e-book manager.","Online teaching platform","Interactive function plotting utility","A tabbed remote desktop application with a Chrome-like UI and support for RDP, VNC, SSH, and remote PowerShell connections.","Vim is a highly configurable text editor built to make creating and changing any kind of text very efficient","Trillian is a proprietary multiprotocol instant messaging application.","VMware Workstation Player allows you to run a second, isolated operating system on a single PC.","Virtual Magnifying Glass is a free, open source, cross-platform screen magnification tool. It is simple, customizable, and easy-to-use.","WireGuard® is an extremely simple yet fast and modern VPN that utilizes state-of-the-art cryptography.","A cross-platform program for developing Haskell projects","World’s Fastest VPN. Take back your freedom with hide.me VPN.","Huawei share onehop and multi-screen collaboration","Community builds using source code from OpenJDK project","A build tool for Scala, Java, and more","Vim is a highly configurable text editor built to make creating and changing any kind of text very efficient","Windows Shell Interface to Git","UltraVNC is a powerful, easy to use and free remote PC access software that can display the screen of another computer (via internet or network) on your own screen. The program allows you to use your mouse and keyboard to control the other PC remotely.","The WeakAuras Companion is a cross-platform (Windows/macOS/Linux) application built to provide the missing link between Wago and the WeakAuras World of Warcraft addon. It enables you to fetch updates to the auras you have installed directly from Wago, without having to manually copy-paste import strings all the time. It also makes sure you don't miss any updates, always keeping you up to date with the latest versions.","Browse the web your way, with the indie web browser.","A powerful, yet easy to use Markdown Editor, Viewer and Weblog Publisher for Windows.\nCreate Markdown with a powerful yet low key interface that provides many helpful support features,\nbut gets out of your way to keep you productive creating content quickly.\n","The enhanced Image Viewer for (Windows/MacOS/Linux)","XMP is a media player developed by XunLei","XunLeiX is a download tool developed by Xunlei.","The world’s most widely used web app scanner. Free and open source.","Video and audio conferencing, chat, and webinars","Ubuntu on Windows allows you to use Ubuntu Terminal and run Ubuntu command line utilities including bash, ssh, git, apt and many more.","Windows X Server","Windows Taskbar Customization Tool","A typing tutor that teaches you to touch type. It supports French, German, Portuguese, US-Dvorak, US-English, Hebrew, Numeric-keypad and more. Typefaster accessible is for blind users. Full Spanish version also. Includes a 3d game. Teacher class support.","Simple. Secure. Reliable messaging. With WhatsApp, you'll get fast, simple, secure messaging and calling for free*, available on phones all over the world.","A powerful, yet easy to use Markdown Editor, Viewer and Weblog Publisher for Windows.\nCreate Markdown with a powerful yet low key interface that provides many helpful support features,\nbut gets out of your way to keep you productive creating content quickly.\n","Video and audio conferencing software with chat and other features","Zotero is a free, easy-to-use tool to help you collect, organize, cite, and share research.","Powerful and easy to use e-book manager.","LÖVE is an *awesome* framework you can use to make 2D games in Lua.","There often comes a need to use built-in command-line tools in English in non-English Windows, as they are localized to another language which can be difficult for admins who only speak English. Englishize Cmd conveniently englishizes Windows command-line interface with 'englishizecmd' command (EnglishizeCmd.bat) and restores to the original language with 'restorecmd' command (RestoreCmd.bat).","Typora gives you a seamless experience as both a reader and a writer. It removes the preview window, mode switcher, syntax symbols of markdown source code, and all other unnecessary distractions. Instead, it provides a real live preview feature to help you concentrate on the content itself.","Open-source software for volunteer computing and grid computing","3D Open Source Real-Time Strategy Game Command the forces of The Project in a battle to rebuild the world after mankind has been nearly destroyed by nuclear missiles. Offers an extensive single-player campaign, cross-platform multiplayer, local skirmish with AI bots.","0 A.D. is a free, open-source, historical Real Time Strategy (RTS) game currently under development by Wildfire Games, a global group of volunteer game developers. As the leader of an ancient civilization, you must gather the resources you need to raise a military force and dominate your enemies.","Accomplish more in World of Warcraft with in-game guides for Leveling, Gold, Professions, Achievements, and more.","Desktop client for Zulip, an open source team chat application.","7-Zip with support for Brotli, Fast-LZMA2, Lizard, LZ4, LZ5 and Zstandard","WinDynamicDesktop ports the Dynamic Desktop feature from macOS Mojave to Windows 10. It uses your location to determine the times of sunrise and sunset, and changes your desktop wallpaper based on the time of day. Choose a theme and enter your location the first time you run the app, then it will minimize to your system tray and change the wallpaper in the background. You can import custom themes or create your own, and customize the app to automatically change the Windows 10 theme color or update your location periodically.","System Information for Windows - Everything you want to know about your computer","VMware Horizon Client for Windows makes it easy to access your remote desktops and published applications with the best possible user experience on the Local Area Network (LAN) or across a Wide Area Network (WAN).","VSCodium is a community-driven, freely-licensed binary distribution of Microsoft’s editor VSCode","VSCodium is a community-driven, freely-licensed binary distribution of Microsoft’s editor VSCode","VREW is a video editing program, powered by AI technology.Edit and caption your videos with speech recognition.","A peer-to-peer streaming torrent client written completely in JavaScript.","This program is designed to write a raw disk image to a removable device or backup a removable device to a raw image file. It is very useful for embedded development, namely Arm development projects (Android, Ubuntu on Arm, etc)","Wings 3D is an advanced subdivision modeler that is both powerful and easy to use.","Launcher for Windows, an alternative to Alfred and Launchy.","X-Moto is a challenging 2D motocross platform game, where physics plays an all important role in the gameplay. You need to control your bike to its limits, if you want to have a chance to finish the most difficult challenges.","A barcode encoding library supporting over 50 symbologies including Code 128, Data Matrix, USPS OneCode, EAN-128, UPC/EAN, ITF, QR Code, Code 16k, PDF417, MicroPDF417, LOGMARS, Maxicode, GS1 DataBar, Aztec, Composite Symbols and more.","Video and audio conferencing software with chat and other features","Software to warm up your computer display at night, to match your indoor lighting.","Gpg4win - a secure solution for file and email encryption.","Better shutdown menu for Windows","Safely store and manage your photos, contacts, notes, and other important information on the cloud, and automatically sync your data from any of your mobile devices.","All-in-one Graphic Design, Best Screen Capture Software, Image Editor, Color Picker, Pixel Ruler and More.","A fast, easy and free BitTorrent client.","Uplay service is a system that provides rewards and achievements for our players. This system also allows for games to use online content for statistics as well as the ability to share activities with friends.","Local is a free local development environment designed to simplify the workflow of WordPress developers and designers. Download it for free today!","WinDynamicDesktop ports the Dynamic Desktop feature from macOS Mojave to Windows 10. It uses your location to determine the times of sunrise and sunset, and changes your desktop wallpaper based on the time of day. Choose a theme and enter your location the first time you run the app, then it will minimize to your system tray and change the wallpaper in the background. You can import custom themes or create your own, and customize the app to automatically change the Windows 10 theme color or update your location periodically.","A lightweight utility that makes the Windows taskbar translucent/transparent.","Public VPN Service","Two factor authentication client","The UniFi® Network Controller allows you to manage your UniFi network using a web browser.","Uplay service is a system that provides rewards and achievements for our players. This system also allows for games to use online content for statistics as well as the ability to share activities with friends.","VSCodium is a community-driven, freely-licensed binary distribution of Microsoft’s editor VSCode","WinSCP is an open source free SFTP client, FTP client, WebDAV client, S3 client and SCP client for Windows. Its main function is file transfer between a local and a remote computer. Beyond this, WinSCP offers scripting and basic file manager functionality.","science fantasy MMORPG","Video and audio conferencing software with chat and other features","qBittorrent is a bittorrent client programmed in C++ / Qt that uses libtorrent (sometimes called libtorrent-rasterbar) by Arvid Norberg. 1. Auto Ban Xunlei, QQ, Baidu, Xfplay, DLBT and Offline downloader 2. Temporary IP Filter API for advanced user 3. Update MessageBox with changelog if NEW version is available 4. Auto Ban Unknown Peer from China Option 5. Auto Update Public Trackers List 6. Auto Ban BitTorrent Media Player Peer Option","Media Player Classic - Home Cinema (MPC-HC) is a free and open-source (OSS) video and audio player for Windows.","mRemoteNG is an open source, tabbed, multi-protocol, and remote connections manager.","Community builds using source code from OpenJDK project","Free and reliable P2P Bittorent client.","Community builds using source code from OpenJDK project","Reko is a binary decompiler.","AeroZoom enhances upon Windows Magnifier and optionally Sysinternals ZoomIt to enable full screen magnification by mouse-wheeling and pinch-to-zoom, as well as turning any mouse into a Home-Theater PC/presentation mouse, where zooming and positioning becomes a breeze without a keyboard.","Use the easiest to manage and most widely supported network virtualization platform to connect all your devices, cloud VMs, and apps as if the whole world is one big cloud region!","Zotero is a free, easy-to-use tool to help you collect, organize, cite, and share research.","A mini-cloud on your Mac or Windows workstation.","Design and share circuit diagrams using a wide range of components.","World’s Fastest VPN. Take back your freedom with hide.me VPN.","Enable secure remote connections to a PC through Windows Remote Desktop, Mac Screen Sharing, Virtual Network Console, and other tools without opening communication ports that can be exploited by intruders. Use these native applications to speed up configuring endpoints, and peer to peer connections.","MQTT Explorer is a comprehensive and easy-to-use MQTT Client.","An Electron remote client app for uTorrent server","Trusted by millions of users, Ultimaker Cura is the world’s most popular 3D printing software. Prepare prints with a few clicks, integrate with CAD software for an easier workflow, or dive into custom settings for in-depth control.","The Battle for Wesnoth is an open source, turn-based strategy game with a high fantasy theme. It features both singleplayer and online/hotseat multiplayer combat.","WinDirStat is a disk usage statistics viewer and cleanup tool for various versions of Microsoft Windows.","WireGuard® is an extremely simple yet fast and modern VPN that utilizes state-of-the-art cryptography.","Yarn is a package manager that doubles down as project manager. Whether you work on one-shot projects or large monorepos, as a hobbyist or an enterprise user, we've got you covered.","Locate files and folders by name instantly.","TortoiseSVN is a really easy to use Revision control/version control/source control software for Windows. It is based on Apache™ Subversion (SVN)®; TortoiseSVN provides a nice and easy user interface for Subversion.","Trusted by millions of users, Ultimaker Cura is the world’s most popular 3D printing software. Prepare prints with a few clicks, integrate with CAD software for an easier workflow, or dive into custom settings for in-depth control.","VSCodium is a community-driven, freely-licensed binary distribution of Microsoft’s editor VSCode","Listen to music from everywhere","WinSCP is an open source free SFTP client, FTP client, WebDAV client, S3 client and SCP client for Windows. Its main function is file transfer between a local and a remote computer. Beyond this, WinSCP offers scripting and basic file manager functionality.","WinSCP is an open source free SFTP client, FTP client, WebDAV client, S3 client and SCP client for Windows. Its main function is file transfer between a local and a remote computer. Beyond this, WinSCP offers scripting and basic file manager functionality.","Ubuntu on Windows allows you to use Ubuntu Terminal and run Ubuntu command line utilities including bash, ssh, git, apt and many more.","Windows application to paste clipboard contents into files like in KDE","MultiBootUSB is a cross platform software written in python which allows you to install multiple live linux on a USB disk non destructively and option to uninstall distros. Try out the world's first true cross platform multi boot live usb creator for free.","Open-source software for volunteer computing and grid computing","Weka is a collection of machine learning algorithms for solving real-world data mining problems. It is written in Java and runs on almost any platform. The algorithms can either be applied directly to a dataset or called from your own Java code.","ghostwriter is a Windows and Linux text editor for Markdown, which is a plain text markup format created by John Gruber. For more information about Markdown, please visit John Gruber’s website at http://www.daringfireball.net. ghostwriter provides a relaxing, distraction-free writing environment, whether your masterpiece be that next blog post, your school paper, or your NaNoWriMo novel. For a tour of its features, please visit the ghostwriter project page.","Windscribe encrypts your browsing activity, blocks ads, and unblocks entertainment content.","X2Go Client is a graphical client (Qt5) for the X2Go system. You can use it to connect to running sessions and start new sessions.","Hyper","Free Note Taking App","calibre is a powerful and easy to use e-book manager.","Online teaching platform","PresenceLight is a solution to broadcast your various statuses to a Phillips Hue or LIFX light bulb.","PresenceLight is a solution to broadcast your various statuses to a Phillips Hue or LIFX light bulb.","Community builds using source code from OpenJDK project","Named after getmac and chmod, ChMac is a command-line-interface (CLI) tool for Windows that changes or randomizes MAC addresses of specified network adapters, e.g. for a client device to reuse public Wi-Fi hotspot that has exceeded usage limit for the day (e.g. hotels, restaurants), or to enhance security","Foldit is a revolutionary new game, in which you play to solve puzzles, and we test your solutions to work on curing cancer, AIDS, and a host of diseases.","VMware Horizon Client for Windows makes it easy to access your remote desktops and published applications with the best possible user experience on the Local Area Network (LAN) or across a Wide Area Network (WAN).","A free and open source cross-platform multimedia player and framework that plays most multimedia files as well as DVDs, Audio CDs, VCDs, and various streaming protocols.","The new Vivaldi browser protects you from trackers, blocks unwanted ads, and puts you in control with unique built-in features. Get Vivaldi and browse fast.","A powerful, yet easy to use Markdown Editor, Viewer and Weblog Publisher for Windows.\nCreate Markdown with a powerful yet low key interface that provides many helpful support features,\nbut gets out of your way to keep you productive creating content quickly.\n","A powerful, yet easy to use Markdown Editor, Viewer and Weblog Publisher for Windows.\nCreate Markdown with a powerful yet low key interface that provides many helpful support features,\nbut gets out of your way to keep you productive creating content quickly.\n","Wireshark is the world's foremost and widely-used network protocol analyzer. It lets you see what's happening on your network at a microscopic level and is the de facto (and often de jure) standard across many commercial and non-profit enterprises, government agencies, and educational institutions.","A unofficial player for youtube music on desktop","Video and audio conferencing software with chat and other features","Angry IP scanner is a very fast IP address and port scanner.","Powerful and easy to use e-book manager.","Free and open-source photography application software and raw developer.","PresenceLight is a solution to broadcast your various statuses to a Phillips Hue or LIFX light bulb.","A tool for Windows to copy text from dialogs and controls which don't allow it otherwise","Wirelessly transfer & backup your photos & videos.","Vim is a highly configurable text editor built to make creating and changing any kind of text very efficient"]